<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	if ($data->callback_query)
	{
		if ($data->text == "as-farvardin")
		{
			$text= "متولدین فروردین :"."\n"."📍 سمبل : قوچ"."\n"."📍 عنصر: آتش"."\n"."📍 سياره : مريخ"."\n"."📍 عضو آسيب پذير :سر"."\n"."📍 روز اقبال : سه شنبه"."\n"."📍 اعداد شانس : 6 ، 9"."\n"."📍 سنگ خوش يمن: الماس"."\n"."📍 رنگ : قرمز"."\n"."فرورديني ها در پي عشق آتشين و پر شورترين عشق ممكن اند."."\n"."او خود به خود جنس مخالف را جذب مي كند . لذتهاي جسماني براي او بسيار اهميت دارد و گاه احساس مالكيت شديدي نسبت به معشوق خود را دارد.";
		}
		else if ($data->text == "as-ordibehesht")
		{
			$text= "متولدین اردیبهشت :"."\n"."📍 سمبل : گاو نر"."\n"."📍 عنصر : خاك"."\n"."📍 سياره : ناهيد"."\n"."📍 عضو آسيب پذير : گردن"."\n"."📍 روز اقبال : جمعه"."\n"."📍 اعداد شانس : 4و6"."\n"."📍 سنگ خوش يمن : زمرد سبز"."\n"."📍 رنگ : آبي روشن"."\n"."📍 گل : خشخاش"."\n"."📍 حيوان : گاو"."\n"."جذاب است و عشقش تا حدي نفساني."."\n"."براي او عشق اهميت زيادي دارد و اگر عاشق شود عاشقي فداكار خواهد بود"."\n"."معمولا صبر ميكند ابتدا طرف مقابل تعهد خود را ثابت كند و سپس خود را در اين تعهد شريك ميكند.";
		}
		else if ($data->text == "as-khordad")
		{
			$text= "متولدین خرداد : "."\n"."📍 سمبل : دو قلوها"."\n"."📍 عنصر : هوا"."\n"."📍 سياره : عطارد"."\n"."📍 عضو آسيب پذير : دست و شانه"."\n"."📍 روز اقبال :چهارشنبه"."\n"."📍 اعداد شانس : 5و9"."\n"."📍 سنگ خوش يمن : عقيق"."\n"."📍 رنگ : زرد"."\n"."📍 گل : زنبق"."\n"."📍 حيوان : پروانه"."\n"."چه راحت ميتوان عاشق او شد."."\n"."جذابيت و شيريني كلام او به خوبي بر اين مدعاست.او عاشق شادي و خوش بودن است و اگر نتواني او را شاد كني جذابيت خود را از دست مي دهي.";
		}
		else if ($data->text == "as-tir")
		{
			$text= "متولدین تیر :"."\n"."📍 سمبل : خرچنگ"."\n"."📍 عنصر : آب"."\n"."📍 سياره : ماه"."\n"."📍 عضو آسيب پذير : سينه و شكم"."\n"."📍 روز اقبال : دوشنبه"."\n"."📍 اعداد شانس :3و7"."\n"."📍 سنگ خوش يمن : مرواريد"."\n"."📍 رنگ : نقره ايي"."\n"."📍 حيوان : حيوانات صدفدار"."\n"."او مانند سياره خود ، ماه در حال تغيير است."."\n"."اگر به او اطمينان كامل نداشته باشي هرگز رابطه ي عاشقانه با اونخواهيد داشتاو از عشق ورزيدن لذت مي برد و در عوض ميخواد آن را دريافت كند.";
		}
		else if ($data->text == "as-mordad")
		{
			$text= "متولدین مرداد :"."\n"."📍 سمبل : شير"."\n"."📍 عنصر :آتش"."\n"."📍 سياره : خورشيد"."\n"."📍 عضو آسيب پذير : قلب و پشت بدن"."\n"."📍 روز اقبال : يكشنبه"."\n"."📍 اعداد شانس : 8و9"."\n"."📍 سنگ خوش يمن : ياقوت"."\n"."📍 رنگ : زرد"."\n"."📍 گل : آفتابگردان"."\n"."📍 حيوان : گربه سانان"."\n"."عاشق عاشق شدن است و معشوق خود را غرق هداياي خود مي كند تلاش مي كند تا رابطه ي عاشقانه ي بي نقصي را خلق كند.";
		}
		else if ($data->text == "as-shahrivar")
		{
			$text= "متولدین شهریور :"."\n"."📍 سمبل : باكره"."\n"."📍 عنصر : خاك"."\n"."📍 سياره : عطارد"."\n"."📍 عضو آسيب پذير : سيستم عصبي"."\n"."📍 روز اقبال : چهارشنبه"."\n"."📍 اعداد شانس : 3و5"."\n"."📍 سنگ خوش يمن : یاقوت كبود"."\n"."📍 رنگ : سبز"."\n"."📍 گل : بنفشه"."\n"."📍 حيوان : سگ كوچك – گربه"."\n"."مي تواند چنان تودار باشد كه به نظر برسد كه از برخورد با ديگران منع شده ."."\n"."ولي آن گاه كه به عشق واقعي خود دست پيدا كند ديگر اين ويژگي او را نخواهيد ديد.براي چنين انسان فدكارومهربان تحمل سختي بسيار با ارزش است او به آساني در عشق گول نمي خورد چون مي داند در پي چيست.";
		}
		else if ($data->text == "as-mehr")
		{
			$text= "متولدین مهر :"."\n"."📍 سمبل : ترازو"."\n"."📍 عنصر : هوا"."\n"."📍 سياره : ونوس"."\n"."📍 عضو آسيب پذير : كمر و كليه ها"."\n"."📍 روز اقبال : جمعه"."\n"."📍 اعداد شانس : 6و9"."\n"."📍 سنگ خوش يمن : الماس"."\n"."📍 رنگ : آبي و بنفش"."\n"."📍 گل : سرخ"."\n"."📍 حيوان : خزندگان"."\n"."او مي تواند دوست خوب و ميزباني عالي باشد او در سياست دومي ندارد.";
		}
		else if ($data->text == "as-aban")
		{
			$text= "متولدین آبان :"."\n"."📍 سمبل : عقرب"."\n"."📍 عنصر : آب"."\n"."📍 سياره : پلوتون"."\n"."📍 روز اقبال : سه شنبه"."\n"."📍 اعداد شانس : 2و4"."\n"."📍 سنگ خوش يمن : ياقوت زرد"."\n"."📍 رنگ : قرمز"."\n"."📍 حيوان : حشرات"."\n"."مرموز است ولي ميتواند عاشق باشد.از حمايت ديگران لذت مي برد."."\n"."او مي تواند حسود و تودار باشد.با كسي كه حس كند قابل اطمينان است كنار مي آيد.";
		}
		else if ($data->text == "as-azar")
		{
			$text= "متولدین آذر :"."\n"."📍 سمبل : كمان دار"."\n"."📍 عنصر : آتش"."\n"."📍 سياره : ژوپيتر"."\n"."📍 عضو آسيب پذير : كبد"."\n"."📍 روز اقبال : پنج شنبه"."\n"."📍 اعداد شانس : 5و7"."\n"."📍 سنگ خوش يمن : فيروزه"."\n"."📍 رنگ : ارغواني"."\n"."📍 گل : نرگس"."\n"."📍 حيوان : اسب"."\n"."اگر شخص مورد علاقه اش را پيدا كند وفادار است.مشكل اينجاست كه خواسته اش را بيان نمي كند و صبر ميكند تا خودتان حدس بزنيد.";
		}
		else if ($data->text == "as-dey")
		{
			$text= "متولدین دی :"."\n"."📍 سمبل : بز"."\n"."📍 عنصر : خاك"."\n"."📍 سياره : زحل"."\n"."📍 عضو آسيب پذير : زانو- استخوان"."\n"."📍 روز اقبال : شنبه"."\n"."📍 اعداد شانس :8و9"."\n"."📍 سنگ خوش يمن : عقيق رنگارنگ"."\n"."📍 رنگ : سياه و قهوه ايي"."\n"."عجله ايي در عشق ندارد.نه به سرعت عاشق مي شود نه به سادگي راز دل خود را مي گويد او همواره در حركت است ولي نمي داند چرا.فقط مي داند بايد موفق شود اگر فكر ميكنيد مي توانيد او را از رسيدن به هدفش باز داريد و به سمت خود جذب كنيد سخت در اشتباهيد.";
		}
		else if ($data->text == "as-bahman")
		{
			$text= "متولدین بهمن :"."\n"."📍 سمبل : آب گير"."\n"."📍 عنصر : هوا"."\n"."📍 سياره : زهره"."\n"."📍 عضو آسيب پذير : مچ و ساق پاها"."\n"."📍 روز اقبال : چهارشنبه"."\n"."📍 اعداد شانس : 1و7"."\n"."📍 سنگ خوش يمن : ياقوت ارغواني"."\n"."📍 رنگ : آبي"."\n"."📍 حيوان : پرندگان درشت اندام"."\n"."اگر عاشق متولد بهمن باشيد با تمام وجود عاشق شما خواهد شد تنها نكته ايي كه بايد از آن دوري جوييد اين است كه بر سر راه پيشرفت او قرار نگيريد. او عاشقي صادق است. دير عصباني مي شود. آزار دهنده نيست .برنامه هاي خودش را دارد .هرگز تغيير نخواهد كرد.اگر نتوانيد خود را با ايده هاي گوناگون مذهبي ،فرهنگي و اجتماعي او هماهنگ كنيد هرگز شانسي براي دستيابي به عشق پايدار او نخواهيد داشت.";
		}
		else if ($data->text == "as-esfand")
		{
			$text= "متولدین اسفند :"."\n"."📍 سمبل : دو ماهي كه خلاف جهت هم شنا مي كنند"."\n"."📍 عنصر : آب"."\n"."📍 سياره : نپتون"."\n"."📍 عضو آسيب پذير : پاها"."\n"."📍 روز اقبال : جمعه"."\n"."📍 اعداد شانس : 2و6"."\n"."📍 سنگ خوش يمن : ياقوت كبود"."\n"."📍 رنگ : سبز روشن"."\n"."📍 گل : نسرين"."\n"."📍 حيوان : ماهي"."\n"."او به پاي معشوق فداكاري هاي بسيار مي كند."."\n"."اگر عاشق شماست واقعا خوشبختيد."."\n"."براي حفظ اين رابطه از هيچ كاري رويگردان نيست."."\n"."مادامي كه به او وفادار باشيد از آن شما خواهد بود.";
		}
		
		$telegram->editMessageText([
		'chat_id' => $data->chat_id,
		'message_id' => $data->message_id,
		'parse_mode' => 'HTML',
		'text' => $text,
		'reply_markup' => $keyboard->key_talebini_adadshans() 
		]);
		
		$telegram->answerCallbackQuery([
		'callback_query_id' => $data->callback_query_id,
		'show_alert' => false,
		'text'=>"طالع بینی ماه مورد نظر ارسال شد"
		]);
	}
	else
	{
		$database->update("users", [ 'last_request' => null ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
		'chat_id' => $data->chat_id,
		'parse_mode' => 'HTML',
		'text' => "<a href='".$auth->path."/actions/talebini/sub-menu/images/adadshans.jpg'>‌‌</a>"."خصوصیات متولدین ماه های مختلف:سمبل-عنصر-سیاره -روز اقبال-اعداد شانس-سنگ خوش یمن-رنگ",
		'reply_markup' => $keyboard->key_talebini_adadshans()
		]);
	}
?>

