<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	
	if ( $constants->last_message === null ) 
	{
		$database->update("users", [ 'last_query' => 'chini' ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
        'chat_id' => $data->chat_id,
		'text' => "انسان از آغاز پیدایش با روح کنجکاو خود همواره در پی یافتن پاسخ‌هائی برای سوالات بیشمار خود بوده است: جهان هستی چگونه شکل گرفت؟ خورشید و ستارگان چگونه پدید آمده‌اند؟ زندگی چیست؟ آیا سرنوشت هر انسان از قبل مشخص شده است؟ و هزاران سوال دیگر."."\n"."در آغاز او برای هر واقعه و پدیده، خدائی قائل بود. یعنی تصور می‌کرد اگر سیل می‌آید یا طوفان رخ می‌دهد خدایان خشمگین شده‌اند. طالع بینی اولیه نیز بر اساس ستارگان آسمان بر سرنوشت بشر و دیگر جانداران و حتی گیاهان پا گرفت. طالع بینان نخستین همه پیکره‌های آسمانی را صاحب عقل و شعور می‌دانستند و آنان را خدایانی تصور می‌کردند که تمام حرکات و پدیده‌های زمینی را تحت کنترل دارند و آنها را مسئول هر واقعه خوب یا بد در روی کره زمین می‌پنداشتند."."\n"."در حقیقت طالع بینی در ابتدا با خرافات و موهومات و سحر و جادو آغشته بود ولی بعدها راه خود را جدا کرد و حتی در دوره‌ای از تاریخ در برخی دانشگاه‌ها تدریس می‌شد. طالع بینان چینی نیز با توجه به فرهنگ غنی و سابقه تمدن طولانی خود در این علم پیشرفت‌های به سزائی داشته‌اند."."\n"."✅ لطفاً سال تولد خود را مطابق مثال و با اعداد انگلیسی تایپ و سپس ارسال کنید:"."\n"."به عنوان مثال : "."\n"."1374",
        'reply_markup' => $keyboard->go_back()
		]);
	}
	elseif ( $constants->last_message == 'chini' ) 
	{		
		if ( $data->text == $keyboard->buttons['go_back'] ) 
		{
			$database->update("users", [ 'last_query' => null ], [ 'id' => $data->user_id ]);
			
			$telegram->sendMessage([
			'chat_id' => $data->user_id,
			'text' => 'بخش مورد نظر خود را انتخاب نمایید:' ,
			'reply_markup' => $keyboard->key_talebini()
			]);
		}
		else 
		{
			if(is_numeric($data->text))
			{
				$database->update('users', ['birthday' => $data->text,'last_query' => null], ['id' => $data->user_id]);	
				
				$ezhdeha = array(1283,1295,1307,1319,1331,1343,1355,1367,1379,1391);
				$mar = array(1284,1296,1308,1320,1332,1344,1356,1368,1380,1392);
				$asb = array(1285,1297,1309,1321,1333,1345,1357,1369,1381,1393);
				$boz = array(1286,1298,1310,1322,1334,1346,1358,1370,1382,1394);
				$meymon = array(1287,1299,1311,1323,1335,1347,1359,1371,1383,1395);
				$khoros = array(1288,1300,1312,1324,1336,1348,1360,1372,1384,1396);
				$sag = array(1289,1301,1313,1325,1337,1349,1361,1373,1385,1397);
				$khok = array(1290,1302,1314,1326,1338,1350,1362,1374,1386,1398);
				$mosh = array(1291,1303,1315,1327,1339,1351,1363,1375,1387,1399);
				$gav = array(1292,1304,1316,1328,1340,1352,1364,1376,1388,1400);
				$babr = array(1293,13.5,1317,1329,1341,1353,1365,1377,1389,1401);
				$gorbe = array(1294,1306,1318,1330,1342,1354,1366,1378,1390,1402);
				
				if(in_array($data->text, $ezhdeha))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐉 مشخصات متولدین سال اژدها :"."\n"."زود گول می‌خورد و کمال‌گرا مغرور و باهوش محکم با‌اراده بخشنده دل به کسی نمی‌بندد تنها خیره‌کننده و اغلب دچار بد‌ترین وضعیت‌ها می‌شود این شهامت را دارد که اشتباهسش را بپذیرد معمولاً دیر ازدواج می‌کند و اما با موش عاشق پیشه و مار وخروسی مغرور ارتباط خوبی دارد از بین تمام علامت‌ها تنها میمون قادر است که اژدها را فریب دهد ارتباط اژدها و ببر به ندرت می‌تواند آرام باشد و نیز باید از سگ بپرهیزد. ",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $mar))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐍 مشخصات متولدین سال مار :"."\n"."جذاب، احساسات، شوخ، زیبا، روشنفکر، فیلسوف، دقیق، حسابگر، اهل خطر کردن نیست، سختگیر، زنان متولد این ماه معمولاً زیبا هستند. مار وقتش را بیهوده تلف نمی‌کند و کمتر عمرش را با پر‌گوئی و بیهوده‌گوئی از دست می‌دهد و به احساس و درک اولیه‌اش در موارد مختلف ایمان دارد و چون در شناسائی محیط و مردم اشتباه نمی‌کند اغلب قدم صحیح بر‌می‌دارد. حس ششم او همان قدر قوی است که پنج حس دیگر او قوی می‌باشد در مورد امور مالی مار اقبال بلند دارد به سرعت تصمیم می‌گیرد و در راه رسیدن به هدفش آسمان را به زمین می‌آورد و اجازه نمی‌دهد هیچ مانعی در سر راهش قرار گیرد کمک‌کردن به مردم را بزرگترین کار‌ها می‌داند و در امور عشقی با ببر قادر به انجام هیچ کاری نمی‌باشد.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $asb))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐎 مشخصات متولدین سال اسب :"."\n"."اسب همیشه فوق‌العاده به نظر می‌رسد عاشق مکان‌های عمومی، ورزشکار، شوخ، نکته‌سنج، زرنگ، ناآرام، خودخواه، خود‌دوست، اقتصاد‌دان، به خاطر عشق از همه چیز می‌گذرد. خونگرم هیجانی و نا‌آرام است. اسب با بز و سگ و ببر می‌تواند زندگی خوبی داشته باشد ولی با موش هرگز. ",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $boz))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐐 مشخصات متولدین سال بز :"."\n"."شیک پوش، جذاب، هنرمند، خجالتی، مطبوع و دلپذیر، مذهبی، خوش‌قلب، دست و دلباز، آرامش‌طلب، عاشق گفتگوی هنری، بز، خیال‌باف کمتر از هر کسی به وقت‌شناسی اهمیت می‌دهد، او بدون نظر و قصد دوستانش را می‌رنجاند او می‌تواند صنعتگر و هنرمند خوبی باشد او می‌تواند در کنار گربه، خوک و اسب خوشبخت شود و هیچ موجود دیگری نمی‌تواند در کنار اسب مدت زیادی دوام بیاورد مخصوصاً سگ.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $meymon))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐒 مشخصات متولدین سال میمون :"."\n"."بد‌جنس، دلیر، با همت، شوخ طبع، حیله‌گر، خود‌خواه، روشنفکر، با‌فرهنگ، سیاستمدار، زیرک و دانا، فرصت طلب. او در حقیقت موجودی خود‌مرکز بین است خلا قیت و اصالت افکار میمون به حدی زیاد است که به راحتی می‌تواند سخت‌ترین مشکلات را بدون ترس و واهمه حل کند او هوش سرشاری دارد او در کنار موش و اژدها خوشبخت می‌شود اما موش ببر را دست می‌اندازد.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $khoros))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐓 مشخصات متولدین سال خروس :"."\n"."مغرور لاف‌زن از روی فکر حرف می‌زند، پرهیزکار، صریح‌الهجه، خوش‌لباس، بی‌پروا، رویائی، شجاع، فعال، جمع زن‌ها را دوست دارد گاه برای دفاع از آنچه که می‌گوید حالت حمله پیدا می‌کند او با جرات و شجاع است. خروس با گاو و اژدها خوشبخت می‌شود ولی باید از گربه بپرهیزد. ",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $sag))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐕 مشخصات متولدین سال سگ :"."\n"."خود‌خور و نگران، درونگرا، یک دنده، بدگمان، ترشرو، بدبین، ضد اجتماع، وفادار، صادق، درستکار، وظیفه شناس، از گناه دیگران رنج می برد. ظاهری ساده او همیشه اولین کسی است که علیه بی‌عدالتی داد سخن بر‌می‌آورد در عشق درستکار و ثابت‌قدم است سگ با اسب، ببر و گربه خوشبخت می‌شود ولی از بز و اژدها باید بپر‌هیزد.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $khok))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐖 مشخصات متولدین سال خوک :"."\n"."دلیر بلند‌همت خود‌نما، دقیق، نسبت به گناه وسواسی به او اعتماد کنید. ساده، راز‌دار، گستاخ، بی‌طرف، یک رفیق فوق‌العاده کم‌حرف مثل میمون، یک روشنفکر است. خوک باید از مار فرار کند مادی‌گرا، نفس‌پرست، عاشق میهمانی و تفریح، بز نیز از وجود خوک استفاده خواهد کرد به راحتی می‌تواند سراغ سگ‌ها برود هر چه روز تولدش به سال نو نزدیک‌تر باشد گرفتاری‌هایش بیشتر است.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $mosh))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐀 مشخصات متولدین سال موش :"."\n"."موش زیر نفوذ حالات جاذبه و تجاوز به دنیا آمده است. در نظر اول آرام و متعادل و شوخ جلوه می‌کند ولی مواظب باشید در زیر این چهره‌ آرام و صبور یک روحیه‌ مهاجم و نا‌آرام قرار گرفته است برای مدتی با موشی همخانه و یا همسفر شوید و آن‌وقت کاملاً به روحیه نا‌آرام و مضطرب و انفجارات روحی بی‌موقع او پی خواهید برد. او از ایجاد سر و صدا لذت خواهد برد. خیالبافی‌های موش که اغلب در زمینه نابود‌کردن و خراب‌کردن است گاهی منجر به سازندگی و خلق می‌شود از نظر عشقی و عاطفی موش عاشق میمون می‌شود ولی از اسب باید حذر کند و از گربه هم طبیعتاً به‌ همان دلایل معلوم جانور‌شناسی باید دوری کند.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $gav))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐄 مشخصات متولدین سال گاو :"."\n"."آرام وصبور کم‌رو و کند و دقیق و صاحب روش متعادل و بی‌اهمیت نسبت به خود گاو هوشیار‌ی‌های طبیعیش را پشت یک چهره‌ی خانگی‌اش پنهان می‌کند او اهل تفکر است و به‌همین دلیل شاید تنهائی را دوست می‌دارد و می‌تواند هدفی را تا سر حد تعصب تعقیب کند میهن‌پرستی افراطی دارد متأسفانه برای گاو عشق چیزی جز یک معمای قابل‌قبول نیست می‌تواند با خروس ازدواج موفقیت‌آمیزی داشته باشد همچنین با موش‌ها نیز و مار و میمون هم می‌توانند در کنار گاو زندگی توأم با آرامشی داشته باشند ولی از ببر و بز باید ترسید.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $babr))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐅 مشخصات متولدین سال ببر :"."\n"."ببر یک عیب‌جوی یاغی است و همیشه در حال طغیان بر ضد قدرت‌های مستقر است او همیشه می‌خواهد رهبر باشد اما بدبختانه همچنان‌که برای بیشتر رهبر‌ها پیش می‌آید اغلب آن شایستگی را که منجر به جلب اعتماد دیگران می‌شود فاقد است میمون چه در کار و چه در عشق ببر را دست خواهد انداخت و و باید از مار دوری کند گاو و گربه نیز با ببر سازگار نیستند ولی با سگ و اژدها و اسب می‌تواند رابطه‌ی خوبی داشته باشد. ",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				elseif(in_array($data->text, $gorbe))
				{
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "🐈 مشخصات متولدین سال گربه :"."\n"."خوشحال و با استعداد، خوب، بااحتیاط، لطیف، ملاحظه‌کار، عاشق جمع، اهل غیبت‌کردن، بدگوئی. جاه‌طلبی دارند اما نه خیلی زیاد به حد زیادی پرهیزکارند و رفقای خوبی هستند گربه عاشق جمع است خیلی زود به گریه می‌افتد گربه با بز و سگ درست‌کردار و خوک کنار می‌آید اما از موش باید مثل طاعون بپرهیزد و با ببر نیز چون از همان نژاد است به‌ خوبی از حیله‌هایش با خبر است و در نتیجه از در گیری با او دوری می‌کند.",
					'reply_markup' => $keyboard->key_talebini()
					]);
				}
				else
				{
					$database->update("users", [ 'last_query' => 'chini' ], [ 'id' => $data->user_id ]);
					
					$telegram->sendMessage([
					'chat_id' => $data->user_id,
					'text' => "✅ لطفاً سال تولد خود را مطابق مثال و با اعداد انگلیسی تایپ و سپس ارسال کنید:"."\n"."به عنوان مثال : "."\n"."1374",
					'reply_markup' => $keyboard->go_back()
					]);
				}
			}
			else
			{
				$database->update("users", [ 'last_query' => 'chini' ], [ 'id' => $data->user_id ]);
				
				$telegram->sendMessage([
				'chat_id' => $data->user_id,
				'text' => "✅ لطفاً سال تولد خود را مطابق مثال و با اعداد انگلیسی تایپ و سپس ارسال کنید:"."\n"."به عنوان مثال : "."\n"."1374",
				'reply_markup' => $keyboard->go_back()
				]);
			}
		}
	}
?>



