<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	
	$database->update("users", [ 'last_request' => null ], [ 'id' => $data->user_id ]);
	
	$telegram->sendMessage([
	'chat_id' => $data->chat_id,
	'parse_mode' => 'HTML',
	'text' => "<a href='".$auth->path."/actions/talebini/sub-menu/images/emza.jpg'>‌‌</a>"."🖊 نکاتی درباره طالع بینی امضاءشناسی:"."\n"."📍 كساني كه به طرف عقربه هاي ساعت امضاء مي‌كنند انسان‌هایي منطقي هستند."."\n"."📍 كساني كه بر عكس عقربه‌هاي ساعت امضاء مي‌كنند دير منطق را قبول مي‌كنند و بيشتر غير منطقي هستند."."\n"."📍 كساني كه از خطوط عمودي استفاده مي‌كنند لجاجت و پافشاري در امور دارند."."\n"."📍 كساني كه از خطوط افقي استفاده مي‌كنند انسان‌هاي منظّمی هستند."."\n"."📍 كساني كه با فشار امضاء مي‌كنند در كودكي سختي كشيده‌ا ند."."\n"."📍 كساني كه پيچيده امضاء مي‌كنند شكّاك هستند."."\n"."📍 كساني كه در امضاي خود اسم و فاميل مي‌نويسند خودشان را در فاميل برتر مي‌دانند."."\n"."📍 كساني كه در امضاي خود فاميل مي‌نويسند داراي منزلت هستند."."\n"."📍 كساني كه اسمشان را مي‌نويسند و روي اسمشان خط مي‌زنند شخصيت خود را نشناخته‌اند."."\n"."📍 كساني كه به حالت دايره و بيضي امضاء مي‌كنند ، كساني هستند كه مي‌خواهند به قله برسند."."\n"."⚠ بي شك بيان مطالب افكار مختلف ، نشانه ي تائيد آن نمي باشد."
	]);
?>

