<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	
	if ( $constants->last_message === null ) 
	{
		$database->update("users", [ 'last_query' => 'hendi' ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
        'chat_id' => $data->chat_id,
		'text' => "ابتدا جنسیت خود را انتخاب نمایید:",
        'reply_markup' => $keyboard->key_fal_hendi_jensiat()
		]);
	}
	elseif ( $constants->last_message == 'hendi' ) 
	{		
		if ($data->callback_query)
		{
			if ($data->text == "h-mard")
			{
				$database->update("users", ['last_query' => 'hendi'], [ 'id' => $data->user_id ]);
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' =>"ماه تولد خود را انتخاب کنید:",
				'reply_markup' => $keyboard->key_talebini_hendi_month_mard()
				]);
			}
			elseif ($data->text == "h-zan")
			{
				$database->update("users", ['last_query' => 'hendi'], [ 'id' => $data->user_id ]);
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' =>"ماه تولد خود را انتخاب کنید:",
				'reply_markup' => $keyboard->key_talebini_hendi_month_zan()
				]);
			}
			elseif ($data->text == "hm-farvardin")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد فروردین:"."\n"."نماد : حمل"."\n"."سياره مريخ به آنها عضله و هيكل عالي بخشيده  و از آنجا كه به هواي آزاد علاقه زيادي دارند ، حتي در زمستان هم پوستشان برنزه است . موهاي اين مردان آتشين معمولاً روشن بور است و اگر پوستشان روشن باشد كك مك هاي مليحي دارند . بزرگترين موهبتي كه مرد متولد  فروردين از آن برخوردار است به ابروهايش مربوط ميشود كه شبيه شاخهاي قوچ است. متأسفانه برخي از آنها با گذشت زمان زجر مي كشند و چهره جذاب آنها تغيير مي كند و به آدمي لاغر مردني و ناخوش تبديل ميشوند."."\n"."پيش از آنكه تصميم بگيريد مرد متولد اين برج درست همان چيزي است كه گفته شد. احساسات خود را كنترل كنيد . همه متولدين صورت فلكي حمل قبل از آنكه درگير تجربه هاي عاطفي شوند ، بايد دوباره فكر كنند . چون هر نوع مشاركت و همكاري ، حتي مشاركتهاي تجاري مي تواند براي آنها مشكل ساز باشد. متولد اين برج فراموش مي كند كه همكارانش نيز دركنار او هستند . او مي خواهد قرص و محكم و برنده باشد ، حتي گاهي ازياد مي برد كه براي نان بيار كباب ببر بازي كردن هم بايد دو نفر بود ."."\n"."متولد اين نشانه بسيار شتابزده و نا شكبيا است . مرد متولد اين برج انتظار را دوست ندارد ( براي هيچ چيز ) . اگر فكري در سر دارد مي خواهد همين حالا به انجام برساند و تا هفته آينده صبر نمي كند . به نظر آنها زندگي آنقدر كوتاه است كه نبايد وقت را تلف كرد . همه مردان مريخي بايد قبل ازپرش خوب به اطراف نگاه كنند."."\n"."بيشتر متولدين اين برج عاشق زندگي هستند و مي توانند با شور و اشتياق فراوان مثل زنبور عسل با عجله به اين طرف و آن طرف بروند . شور و شوق كودكانه آنها مي تواند دنيا را براي بقيه ما درخشانتر كند . اما يك بخش در زندگي او وجود دارد كه سبب بروز مشكلاتي ميشود : هيجان و شيفتگي او مي تواند او را مغلوب كند و اين دليلي مي شود كه او بخواهد برشما هم چيره شود! اما اغلب وقتي خواسته اش عملي ميشود ، راه مي افتد تا در جاي ديگري بچرد. بدست آوردن مرد متولد برج فروردين آسان ولي حفظ او مشكل است . حتماً اگر شما را با گره محدود كرد ، باز هم تلاش كنيد تا مسيري درست و حسابي براي دسترسي به او پيدا كنيد."."\n"."مردان متولد اين برج به دليل جاذبه جسمي و گيرايي مريخي ، اغلب جذاب هستند. ويژگي آتشين آنها موجب غرور مي شود. آنها از خود و وجهه خود بسيار آگاه هستند . از آنجا كه مي خواهند هميشه اول باشند ، هم در عشق و هم در تجارت براي خود مسابقه اجرا مي كند . آنها به شريكي احتياج دارند كه با هوش باشد و كارها را به درستي سامان دهد تا بتوانند با توافق، با يكديگر زندگي كنند و يك تيم واقعي باشند چون او از خطر نمي هراسد . قوچ منفي مثل طاووس با ادا و اصول راه مي رود و حتي معشوقه را هم رقيب خود به حساب مي اورد و سعي مي كند با او هم رقابت كند ."."\n"."از آنجا كه او آدم مهمي است شكست را نمي پسندد . او گاه دوست دارد خود نمايي كند و از شريكش همچون دارايي با ارزشي مواظبت كند . به همين دليل زني را دوست دارد كه عالي به نظر برسد ."."\n"."مرد مريخي پدر خوبي است و تا جايي كه ممكن است سعي مي كند بچه ها را به گردش ببرد ( داشتن يك پسر بچه شش ساله بهانه بسيار خوبي براي فوتبال بازي كردن روزهاي جمعه است ) او ازسوت كشيدن دخترانش نيز بسيار خوشحال مي شود  خيلي لي لي به لالاي آنها مي گذارد ( هيچ وقت قادر نيست در مقابل صورتي زيبا مقاومت كند). با اين وجود خلق و خوي بابا هم مي تواند مثل طوفان وحشتناك شود. چون آدمي نيست كه در سكوت بق كند پس داد و هوار مي كند . اما وقتي اين وضعيت را گذراند دوباره يكپارچه لبخند ميشود و صلح و آرامش حاكم خواهد شد. البته براي مدتي! تا آنجا كه به او مربوط مي شود ، همسرش هيچ اشتباهي نمي تواند مرتكب شود. اما به محض آنكه خانم او را تحقير كند ، با غم و غصه هايش تنها مي شود و گاه به جاي جمع و جور كردن تكه هاي خرد شده شخصيتش ، اينجا و آنجا به دنبال وقفه واستراحت مي رود. او گاهي نگرشي كاملاً كودكانه به عشق و زندگي دارد ، و بيش از آنكه با آنها روبرو شود ، از آنها فرار مي كند ."."\n"."قوچ نر آميزه اي شكوهمند از زندگي ، عشق و شهوت است . براي اثبات گفته ام داستاني برايتان نقل مي كنم :"."\n"."يك صبح بهاري مردي در علفزار شصت گوسفند و يك قوچ را مي چراند ، در پايان روز وقتي سلانه سلانه به خانه بر مي گشت شصت گوسفند خواب الوده و يك قوچ عنان گسيخته به همراه داشت ."."\n"."و اين خلاصه اي از ويژگي هاي قوچ نر بود و چقدرهم پررو است ";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-ordibehesht")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد اردیبهشت:"."\n"."نماد : ثور"."\n"."مرد متولد برج ارديبهشت مي تواند خيلي پررو باشد! در اتوبوس يا متروهاي شلوغ هيچ گاه نزديك او نايستيد چون تمايل زيادي دارد كه شما را نيشگون بگيرد! او آدم شوخ طبعي است و با پرتاب پوست موز و كيك ، دلقك بازي در مي آورد . ( هر چيزي كه به غذا شبيه باشد او را خوشحال مي كند . )"."\n"."اعتقاد و وفاداري از خصلتهاي اين مرد ساده است و انتظار دارد كه اين ويژگيها را در هر كس كه مي شناسد، از خدمتكار گرفته تا همسرش پيدا كند و به همين دليل خيلي زود گول زنهاي با هوش را مي خورد او كسي است كه با رضايت قلبي با منشي يا خدمتكارش ازدواج مي كند . او شريكي مي خواهد كه آشپزي و خانه داري را به خوبي بداند . از آنجا كه به نظر دوستانش اهميت مي دهد اهل قمپز و خودنمايي نيست و وقتي دوستان را به خانه مي آورد خانه بايد پر از صميميت بوده و غذايي پر گوشت و شاهانه مهيا باشد ."."\n"."به عكس نشانه هاي ديگر، او شريكش را فقط بر اساس زيبايي اش انتخاب نمي كند . از آنجا كه سياره او ونوس است ، به دنبال كسي نيست كه هميشه خود رادر آينه نگاه مي كند از نظر او ژست شريك مهمتر از چهره اوست و خوش هيكلي را بيشتر از لاغري مي پسندد ."."\n"."دوست ستاره شناسي دارم كه مي گويد قطع رابطه براي اين مرد غم و غصه اي واقعي است و اگر او آدمي منفي باشد . هر قدر ارتباط او با شريكش طولاني تر شود ، حس مالكيتش هم بيشتر مي شود و فراموش مي كند كه او هم انسان است و حتي گاهي به شريك زندگي اش به چشم اثاثيه منزل و يا چيزي كه بابت تهيه آن پول پرداخته ، نگاه مي كند ."."\n"."او خيلي دست و دل باز است و با اشتياق آخرين لقمه غذاي چرب و نرمش را به شما مي دهد حتي پيرهانش را هم از تن در مي آورد و به شما هديه مي كند. ( كه ابريشمي و نرم است .) اين افراد را حتماً در ميهماني هايتان دعوت كنيد چون كسي است كه هميشه مي خندد و گاهي آنقدر مي خندد كه ريسه مي رود و اگر در خوردن غذا و نوشيدني زياده روي كرده باشد واقعاً روده بر مي شود ."."\n"."مرد منفي متولد ارديبهشت بسيار حسود است . اگر شما به عنوان همسر او ، براي كاري پيش بيني نشده  بيرون برويد و يا پنج دقيقه دير كنيد . مي خواهد بداند كجا بوده ايد و يا چه مي كردي. او هميشه به دنبال امنيت مي گردد."."\n"."متولدين ارديبهشت در بين اعضاي بدن خود ، به گردن اهميت بيشتري مي دهند و اغلب گردنهاي كلفتي دارند . برخي از اين مردان تنومند و جذاب هستند، بعضي ديگر هم - كه مشخصه برج آنهاست - استخواني هستند . اما خود ، يعني شانه هاي پهن و كمري صاف را حتماً دارند ."."\n"."آنها عموماً موهاي مجعد و تيره ، چشماني قهوه اي رنگ و با احساس و رنگ پوستي روشن دارند ، عجيب است اما بيشتر آنها كاكل هايشان را روي پيشاني مي ريزند ."."\n"."مرد ارديبهشت مردي است سرشار از عشق و علاقه كه براي عاشق شدن زمان زيادي  مي خواهد . اگر زن خوش شانسي هستيد، مطمئن باشيد هر سي سال يكبار عصبانيت او را خواهيد ديد.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-khordad")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد خرداد:"."\n"."نماد : جوزا"."\n"."به به ! از دست او حتماً سرسام مي گيريد !"."\n"." مردان متولد خرداد بسيار گيرا هستند . دوست شما باشد يا عاشق شما ، به هر حال وسوسه انگير است و جالب اينكه خودش هم به خوبي مي داند !  اگر شما لارو جنبنده اي هستيد پيله اي زيبا به دور شما مي تند و صبر مي كند تا به پروانه‏اي زيبا تبديل شويد ، اما وقتي به خواسته اش رسيد ، به اين نتيجه ميرسد كه ديگر پروانه دوست ندارد و آن وقتست است كه آرام و بي صدا مي رود از آن پيله ابريشمي چيزي به جا نمي ماند و شما هم فقط يك سراب ديده ايد . پس اگر مي‏خواهيد عاشق او شويد از ترفند خودش استفاده كنيد . بهترين راه براي جذب او بي توجهي است . اگر در ميهماني ها تظاهر كنيد كه او را نديده ايد، خواهيد ديد كه چطور به خود مي جنبد و در عرض دو دقيقه به هر بهانه اي كه شده خود را به كنار شما مي كشاند. او به هر چيزي كه در اطرافش باشد توجه مي كند و هميشه بيشترين توجه او به شماست و مشكلات شما از همين جا آغاز مي شود چون چنان براي شما از عشق نجوا مي كند گويي هيچ گاه چنين سخناني نشينده ايد و مشكل عمده تر اينكه او حتي اگر شما را دوست نداشته باشد باز هم  عاشقانه براي شما زمزمه خواهد كرد . او مي ترسد نكند توانايي هاي سرنوشت ساز او ( جذابيت) رو به زوال باشد، پس تصميم مي گيرد توانايي هايش را امتحان كند و ندرتاً شكست مي خورد. واقعيت اين است كه او روحيه اي ماجرا جو دارد . حتي وقتي ازدواج مي كند باز هم نظري به زنهاي ديگر دارد. اگر روزي به شما تلفن كرد و گفت كه به سفر مي رود، خيلي به گفته اش اطمينان نكنيد چون احتمالاً در جاي ديگر مشغول خوشگذراني است."."\n"." مرد خرداد حتي در عين وفاداري به همسرش علاقه دارد تا وارد جمع زنهاي ديگر شده و ابا آنها گپ بزند."."\n"." كمي دقت كنيد شايد مردي متولد خرداد  كه ازدواج كرده واز زندگي اش هم راضي است ولي هنوز هرجاميرود به زنها مي گويد كه عاشق آنهاست (و واقعاً عاشق آنهاست بشناسيد) او همه آنها را دوست دارد ولي به روشهاي مختلف و دلايل متفاوت. سياره متولدين خرداد عطارد است . بسياري از مردان عطاردي چشمهايي زيرك و زيبا و معمولاً مژه هايي بلند دارند. طرز تفكر و سوخت و ساز عطاردي معمولاً از آنها مرداني لاغر اندام مي سازد . از آنجا كه به ژست اهميت مي دهد ، اگر تاجر باشد ، حتماً دسته چكهاي زيادي ( براي ژست و پز) به همراه خواهد  داشت و دفتر كارش پر از تلفنهاي بي سيم شيك و آخرين مدل است و بطور همزمان راه مي رود و صحبت مي كند . دفتر كار او پر از لوازم اداري متنوع است . البته او به واژه پرداز بيش از هر چيزي علاقه دارد ."."\n"." جوزا نشانه ارتباطات است اما براي مرد متولد خرداد ، برقراري ارتباط با نوزاد سخت و گيج كننده است . تا وقتي كه عضو جديد خانواده نمي تواند صحبت كند ، پدر خانواده نگران و عصبي است . اما به محض اينكه نوزاد كوچك شروع به صحبت مي كند شادي پدر هم شروع ميشود. او عاشق بازي كردن با بچه هاست و علت اينكه بچه ها هم عاشق او هستند اين است كه او مثل برادر بزرگتر با آنها رفتار مي كند . بطور كلي فرق نمي كند كه از صدور شناسنامه او چند سال گذشته باشد چون در هرحال او كودكي بيش نيست .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-tir")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد تیر:"."\n"."نماد : سرطان"."\n"." عجب نشانه دوست داشتني است ! مردان متولد اين برج عكس ظاهر بدعنقي كه دارند ، سخت پوستاني دوست داشتني هستند . وقتي به متولد تير فكر مي كنيد ، خرچنگ را از ياد نبريد . بسته به شرايطي دارد،‌ براي رويارويي و يا خلاصي از گرفتاري ، قدم هاي جنبي بر مي دارد، هيچ وقت درباره او بر اساس ظاهرش قضاوت نكنيد ."."\n"." بيشتر مردان متولد برج تير آرام ، احساساتي ، خانگي و شيفته آشپزي هستند . نشانه خرچنگ بر شكم حكومت دارد و ضرب المثل قديمي ، راه ورود به قلب يك مرد از شكمش مي گذرد ، راجع به مردان متولد تير صادق است اگر وي به شما گفت رژيم غذايي دارد ، حرفش را باور نكنيد ."."\n"." او دمدمي است . علت خلق و خوي متغير او ماه است كه سبب مي شود بسيار احساساتي و يا كاملاً سرد و نا اميد باشد . ( او عقل و منطق سرش نمي شود ) قلب متولد تير به مغزش فرمان مي دهد و گاه زندگي او تحت سلطه عواطف اوست . اگر عاشق مردي هستيد كه متولد تير است خبر خوبي برايتان دارم . او راحتتر از مردان متولد ساير برجها ابراز احساسات مي كند ، مردان متولد برجهاي مختلف هر يك احساسات خود را به نوعي بيان مي كنند . متولد آبان به شكل جنسي ، مرد متولد اسفند به شكل رويايي و متولد تير به شكل عاطفي."."\n"." مشكل اصلي شما با او ، اين است كه مي خواهد مادرش باشيد . احساسات او نسبت به مادرش حد وسط ندارد . يا عاشق اوست و يا از او متنفر است . بيزاري او از مادرش گاه سبب ميشود تا از هر زن ديگري (حتي شما) بيزار شود ، يا اين كه مادر را آنقدردوست دارد كه شما احساس مي كنيد فراموش شده ايد پس از مادر شوهر هم نفرت پيدا مي كنيد."."\n"." بيش از آنكه با او پيوند زناشويي بنديد بد نيست بفهميد روابط او با مادرش چگونه است . اگر او از آن مادرهاي پاك باخته است كه پسرش را ننر بار آورده، حتماً با او مشكل پيدا مي كنيد . اگر نمي دانيد او مرد است يا موش يا بچه يا خرچنگ ، تله اي كار بگذاريد تا بفهميد او چيست ؟!"."\n"." او در گذشته زندگي مي كند و ناخودآگاه به دنبال شريكي است كه ياد آور مادرش باشد . او به ريشه ها اهميت زيادي مي دهد و اغلب در شهرستاني كه متولد شده زندگي مي كند و همانجا هم مي ميرد. حتي گاهي خانه دوران كودكي اش را سالها بعد مجدداً مي خرد و همانجا زندگي مي كند ."."\n"." او معمولاً زاده عادت است و بايد مراقب باشد تا عادتهاي بدي كسب نكند، چون عادتهاي قديمي را دير فراموش مي كند . او به دنبال شريكي است كه برايش مادري كند ، اما اگر شخص مناسبي را پيدا نكند با قوم و خويش و دوستان درگيري عاطفي پيدا مي كند به طوري كه دهان همه از تعجب باز مي ماند ."."\n"." او پدري فداكار و تو دل برو است . با اين وجود احساسات او بيشتر مادرانه است تا پدرانه ، مثلاً پس از يك روز سخت كاري ، در خانه پيش بند مي بندد و بدون نق و نوق براي بچه ها آشپزي مي كند. او از اعضاي خانواده مراقبت مي كند‌، آخر هفته بچه ها را بيرون مي برد و حتي از قناري هم مواظب مي كند . او ذاتاً پدر است و برايش خيلي سخت است كه خودش بچه نداشته باشد ، در اين صورت دوستان و همكاران را بچه هاي خود مي داند .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-mordad")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد مرداد:"."\n"."نماد : اسد"."\n"." او محبوب همه است ! او همچون نو ستاره اي ست كه طرفداران خود را از همه جا براي ديدن نمايش جذب مي كند . اين رفتار چيزي بيشتر از يك قمپز در كردن است كه ديگران درباره متولدين مرداد فكر مي كنند. گفتگوي طولاني مدت برايش بسيار آسان است بويژه اگر به زحمت شغلي را در عالم رقابت براي خود دست و پا كرده باشد ."."\n"." اين مردان آدمهاي نمايشي فوق العاده اي هستند . برخي از آنها وقتي پولشان ته مي كشد 500 پوند از بانك وام مي گيرند تا براي دوستان ميهماني ترتيب دهند و شايد هم تصميمي بگيرند با شامپاني و خاويار براي ديگران قمپز بيايند . يكي از خوشايندترين خصلتهاي او علاقه او به خوشحال كردن ديگران است.خوشحال كردن مردم باعث مي شود همه جا احساس صميميت كند ."."\n"." مي توانيد او را از روي موهاي پريشتش بشناسيد . حتي اگر موهايش كوتاه باشد باز هم مثل آن است كه يك فرچه روي دو پا راه مي رود . يا حتي شبيه قلم موي نقاشي است . نكند او را با جارو اشتباه بگيريد خانه را با او جارو كنيد!"."\n"." او دوست دارد شيك باشد . نشانه اسد و ميزان ( نشانه دلبري و لوندي ) هر دو نشانه هاي عشق هستند . از آنجا كه مرد متولد مرداد شبيه جارو است حتي مي تواند خاك روي پاهاي شما را هم جارو كنند . رفتارش شما را مات و مبهوت مي كند ، به شما گل مي دهد ، با هم شام اعياني مفصلي مي خوريد ، به تأتر مي رويد. در واقع وقتي كسي را دوست بداريد با او مثل يك ملكه رفتار مي كنند ."."\n"." مرد متولد مرداد وقتي پدر شود و معركه است . او به بچه ها اهميت مي دهد و مي‏خواهد كلكسيوني از آنها داشته باشد . اگر دوست نداريد بچه دار شويد توصيه مي كنم هيچ وقت با مرد متولد برج مرداد پيمان زناشويي نبنديد . ممكن است در ابتداي آشنايي بگويد : عزيزم اهميتي ندارد. مي توانيم بچه دار نشويم، اما صبر كنيد و ببينيد چه مي شود او دمدمي نيست ، صادق و وفادار است . صداقت و وفاداري از نظر او بسيار مهم هستند قانون او اين است كه شما هم دوستش بداريد و صادق باشيد و به هيچ وجه به او خيانت نكنيد . او اين انتظار را از همه ، از شما ، از همكاران و حتي ازدوستانش نيز دارد ."."\n"." او مي خواهد نان آور منزل و مايه افتخار شما باشد . با قدرت روي پاي خود بايستد و خانواده را تأمين كنند . صبر كنيد كامپيوتر را خاموش نكنيد و با عجله براي يافتن او بيرون نرويد .  او گاهي ريا كار هم هست . اگر او كسي است كه زياد به سفر مي رود ، احتمالاً هرجا ماده شيري هم دارد. عشق مردادي شما خود را حاكم قلمروي شاهانه خود مي بيند و مي خواهدشما و بچه ها در مقابل او تعظيم كنيد . اگر كمي ارام و سر به راه باشيد وضع بدتر مي شود !"."\n"." اگر از قدرتي كه در اخيتار دارد به درستي استفاده نكند از شيري دوست داشتني به قلدري مستبد تبديل مي شود كه ناگهان بي پروا و از خود راضي به نظر مي رسد، قمپز در مي كند ، قيافه مي گيرد و شق و رق راه مي رود .او گاهي از شما مثل سرباز ضعيف بازي شاهانه شطرنج خود استفاده مي كند يا دوستان و خويشان را كلكسيون كشورها مي داند . اگر به قدرت برسد كافي است تا كمي ويژگيهاي منفي داشته باشد آن وقت به ديكتاتور ، و فرمانروايي مستبد تبديل مي شود و هميشه از قدرت خود سوء استفاده مي كند ."."\n"." از آنجا كه دمدمي نيست و ثبات دارد مي خواهد در تمام مراحل اوليه زندگي هم ثبات داشته باشد به همين سبب گاه كله شق مي شود . او به آساني نمي تواند نظرش را در مورد چيزي تغيير دهد. هروقت خواستيد دور و بر او بچرخيد و او را وادار كنيد مثل شما به دنيا نگاه كند فقط يك كار بكنيد ، بيخودي از او تعريف كنيد ، مطمئن باشيد، رد خور ندارد !";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-shahrivar")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد شهریور:"."\n"."نماد : سنبله"."\n"." و حالا مرد عجيب و غريبي را معرفي خواهم كرد. اين مرد ، كسي است كه گاهي شانس خود را در قمار امتحان مي كند. او رک گو است و آنقدر سرد و بي احساس است كه گاهي با خود فكر مي كنيد چه اشتباهي كرده ايد كه به او اينطور رفتار مي كند. اما قبل از آنكه نامه اعتراض آميزي براي ما بفرستيد، بايد بگويم همهء مردان برج شهريور اينگونه نيستند."."\n"." متولدين مرد اين برج چه جذاب باشند ، چه نباشند، معمولاً دوست داشتني به نظر ميرسند. بيشتر آنها پوستي به لطافت ابريشم و به صافي نهر كوهستان، بدون جوش و لك دارند. آنها چشماني قشنگ و معمولاً قهوه اي رنگ دارند كه مثل ستاره ها مي درخشند. مرد متولد برج شهريور بلند قد و لاغر اندام است. او نمونهء بلندي ، سبزه بودن، و خوش تيپي است."."\n"." به لباسهايش اهميت زيادي مي دهد و اغلب سنتي است، حتي وقتي كه اهل مد مي شود و به همين علت احساس ناراحتي مي كند. او پولش را صرف خريد لباسهاي ساده و سنگين و عينك آفتابي موقري مي كند و با كراواتي فوق العاده به لباسها جلوه مي دهد."."\n"." برخي از مردان متولد برج شهريور كمي سرد و بعضي ديگر مشخصاً سرد و بي روحي هستند. براي مرد متولد اين برج سخت است كه خود را از نظر عاطفي متعهد كند چون مي ترسد كنترل اوضاع از دستش خارج شود. او احساسات خود را به طريقي معتدل و دقيق بيان مي كند. سيارهء او - مريخ - سبب مي شود بيش از قلب از طريق ذهن احساس كند. بسياري از انها وقتي روش منطقي را انتخاب مي كنند. احساس امنيت بيشتري دارند."."\n"." مرد شهريور مردي كوشاست و براي رسيدن به آنچه مي خواهد سخت تلاش و كار مي كند ولي الزاماً تلاش او هميشه به سمت پيشرفت و صعود نيست. چون بر عكس متولدين برجهاي ديگر جاه طلبي هاي حيرت انگيز به او القا شده است."."\n"." او مثل متولدين برجهاي قابل تغيير، به دگرگوني و تحول در زندگي نيازمند است. گاهي نظرش را چنان تغيير مي دهد، كه فكر مي كنيد مي خواهد شما را اذيت كند."."\n"." از آنجا كه ابراز احساسات براي او آسان نيست، پدر خوبي نخواهد بود، هر چند كه خودش مي خواهد باشد. اما براي او سخت است كه خودماني رفتار كند. او پدري بسيار منضبط است و وقتي بچه ها تكاليف مدرسه را انجام ندهند الم شنگه به پا مي كند."."\n"." از آنجا كه ابراز احساسات براي او آسان نيست، پدر خوبي نخواهد بود، هر چند كه خودش مي خواهد باشد. اما براي او سخت است كه خودماني رفتار كند. او پدري بسيار منضبط است و وقتي بچه ها تكاليف مدرسه را انجام ندهند الم شنگه به پا مي كند.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-mehr")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد مهر:"."\n"."نماد : میزان"."\n"." او واقعاً مار خوش خط و خالي است ، اما معمولاً به بهترين روش ممكن ، رفتار مي كند. مرد متولد برج مهر مثل شواليه اي است كه در زره مي درخشد و با اسب سفيد جنگي، دوشيزه هاي گرفتار مخمصه را نجات مي دهد. او حتي در قرن بيست و يك هم رنگ و بوي عشق مؤدبانه را فراموش نكرده است. اگر ببيند عجوزه اي ، دوشيزه اي را تهديد مي كند، مي داند چه كار كند . (مطمئن باشيد فرار نخواهد كرد.)"."\n"." او جذاب واستثنايي به نظر مي رسد و كلكسيوني از ادكلن و عطر دارد . به يك مرد متولد برج مهر كه مي شناسيد ، فكر كنيد. آيا زيادي شيك و ظريف نيست ؟"."\n"." اين مرد دوست داشتني ، سياستمدار بزرگي است. او از ناراحت كردن ديگران متنفر است. در واقع او طوري رفتار مي كند كه ثابت كند زمان احترام به بانوان (شواليه گري) به پايان نرسيده است . وي كسي است كه در اتوبوس و مترو بلند مي شود تا شما بنشينيد. او خيلي با نزاكت است . اگر با اين شواليه مهربان ازدواج كنيد، گرچه از نظر شما هميشه جذاب خواهد ماند ، اما به شكلي محسور كننده با همه دوشيزه ها مؤدبانه رفتار مي كند. او بي وفا نيست ، فقط نمي تواند هيچ صورت زيبايي را ناديده بگيرد ."."\n"." جز لاينكف وجودي او اين است كه مي خواهد زيبا و جذاب به نظر برسد . اگر پول داشته باشد لباسهاي سفارشي و پيراهنها ابريشمي از جنس عالي مي پوشد . نه به اين دليل كه آنها نشانه موقعيت اجتماعي هستند ، بلكه او كسي است كه عاشق بهترين ها است ."."\n"." از آن جا كه عنصر وجودي او هواست احساسات او بيشتر از ذهنش سرچشمه مي گيرد تا از قلبش. او فكر مي كند چون ستاره اش ونوس است، پس سرا پا عشق و شور است و نمي خواهد بپذيرد كه گاهي رفتار سردي دارد."."\n"." مردان مثبت متولد برج مهر جذاب هستند ولي مردان منفي مي توانند ، نا مرتب كثيف، بي ادب ، هرزه و نفرت انگيز باشند."."\n"." پدر متولد مهر فداكار است. وي به نوازد علاقه زيادي ندارد چون دايماً بايد تر و خشك شود . اما وقتي آنقدر بزرگ شود كه زبان باز كند ، مورد علاقه بابا خواهد بود راستي يادتان نرود شايد وقت زيادي را به بچه اختصاص ندهد و ترجيح بدهد به جاي بازي با بچه ، يك گيم گلف يا يك دست تنيس بازي كند ."."\n"." او همان كسي است كه شما مي خواهيد";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-aban")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد آبان:"."\n"."نماد : عقرب"."\n"." جذابيت مغناطيسي او سبب ميشود كه جهان از چرخش حول محور خود باز بايستد و در جهت مخالف بچرخد . او خيلي قوي است . او كسي است كه همه ، بويژه زنان تقريباً هركاري برايش انجام مي دهند . بعضي از دخترها همه جا به دنبال او مي گردند(حتي شما). مردان متولد برج آبان رؤساي شركت ،مؤسسه يا سازمان ها هستند ."."\n"." او پوستي به رنگ سبزه تيره ، مويي مشكي و چشماني سياه دارد . البته شايد كسي هم پيدا شود كه  بور باشد. اما تعداد اين گروه در مقايسه با گروه قبل خيلي كم است . او حتي وقتي صورت خود را اصلاح مي كند ، به نظر ميرسد كه چند روز است اصلاح نكرده . او چشماني نافذ دارد آن چنان كه اگر مستقيم به چشمهاي شما نگاه كند، آشفته خواهيد شد ! اغلب زن و مرد متولد برج آبان با عينك ورزشي عجيب و غريب و يا لنزهاي آنچناني، چشمهاي خود را بيشتر به نمايش مي گذارند . خيلي ناراحت كنند ه است كه نوروز او را لباس گرم و عينك آفتابي ببينيد."."\n"." وي احتمالاً غذا هم زياد مي خورد ، اضافه وزن پيدا مي كند . هرچند عميقاً مي خواهد خوش هيكل باشد . اودر روابطش بسيار صادق است . به طور ايده ال زن ظريف و پر جنب و جوش متولد برج حوت (دوماهي) شريكي مناسب براي اوست ،اگر همسر شما متولد برج آبان است بايد به او كاملاً اعتماد كنيد و حتي وقتي اشتباه مي كند ، معتقد باشيد كه او درست مي گويد و اشتباه نكرده است. او به هيچ وجه نمي خواهد شما رقيب او باشيد ."."\n"." تا زماني كه بتواند حسادت خود را كنترل كند ، پدر خوبي است . او بيش از ديگر مردان متولد برجهاني تير . اسفند احساسات خود را نسبت به بچه ها نشان مي دهد . او با خوشحالي به شما اجازه مي دهد كه از نوزاد مراقبت كنيد."."\n"." او مشغله ذهني را در روابطش دخالت مي دهد ."."\n"." قبول كنيد كه بيشتر متولدين برج آبان معني كامل آشفتگي و آشوب هستند است . آنها اعتماد به نفس دارند و خود را چنان تشويق و ترغيب مي كنند كه حتماً بهت زده خواهيد شد و آرزو مي كنيد كه مثل او باشيد ، عليرغم همه اينها اونگراني ، ترس و اوهام زيادي دارد . فراموش نكنيد كه او آدمي جنجالي است .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-azar")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد آذر:"."\n"."نماد : قوس"."\n"." اگر مي خواهيد مردي خوش لباس . خوش گذران از هفت دولت آزاد كه هميشه بليطش برنده مي شود را بشناسيد ، او كسي جز متولد برج اذر نيست . اگر خواستيد سراغ او را بگيرد كافي است سري به محلاتي بزنيد كه نتايج بخت آزمايي را اعلام مي كنند حتماً‌ نامش را جز برندگان خواهيد خواند. او مردي خانگي نيست و دست كم تا وقتي آماده نباشد قيد وبند و تعهد را نمي پذيرد و از آن دوري مي كند . چون براي تنفس به فضاي باز نياز دارد ."."\n"." هر جا هم كه بشود اطراق مي كند. من كسي را مي شناسم كه بلافاصله پس از فارغ التحصيلي از مدرسه ، با پاي پياده دور دنيا سفر كرد ، ازدواج كرد ، همسرش را طلاق داد، براي زندگي به آمريكا بعد هم به كانادا رفت و تا ده سال بعد برنگشت ! اين مردها هيچ تمايلي ندارند كه بشنوند زمين گرد است يا اقيانوس اطلس به علت يخبندان مسدود است،  آنها مانع نمي شوند و بايد هر چيز را خودشان بفهمند ."."\n"." بسياري از مردان متولد برج آذر مجرد هستند و احساس مي كنند از هفت دولت آزاداند، خودمان را گول نزنيم آنها دوست دارند گل سر سبد باشند و مي خواهند بفهمند دردنيا چه خبر است تا جايي كه ممكن است به تنوع نياز دارند ، اگر شمازني حسود هستيد اصلاً زوج مناسبي براي او محبوب نمي شود. اگر شريك شما كمانگير است بايد بدانيد شايد او روزي از خواب بيدار شود و برود و تا يك ماه پيدايش نشود اما اگر در برخورد اول خواسته باشيد او را به صندلي زنجير كنيد و تمام درها و پنجره ها را براي جلوگيري از فرارش او چفت و بست بزنيد، ممكن است هيچ وقت پيدايش نشود ."."\n"." اگر مي خواهيد به شما توجه كند ، بايد وانمود كنيد به او توجهي نداريد . اين مسئله در مورد كليه متولدين برجهاي آتش صادق است . يادتان باشد او شكارچي منطقه البروج است و در چذب دختران استادي قديمي است . طوري رفتار كنيد كه شما را با هوش و علاقمند به يادگيري بداند و با او نرد عشق ببازيد. از آنجا كه گاهي متولد برج آذر و شريك او در شروع آشنايي تعريف درستي از روابط خود ندارند . اين رابطه سالهاي سال از نقطه شروع فراتر نمي رود . اما وقتي ابعاد ديگري از وجود هم را كشف كنند، روابط وستانه شان رشد مي كند ."."\n"." مرد متولد برج آذر وقتي پدر مي شود ، پدر خوبي نيست . اغلب به نوزاد علاقمند نيست. اماوقتي صداي بچه كوچولو را بشنود، عقيده اش تغيير مي كند. به اين ترتيب درنگهداري بچه اهل همدردي و همدلي نيست و همانطور كه كارهاي خودش را بدون شما انجام مي دهد، شما ا در نگهداري بچه به راستي تنها مي گذارد."."\n"." اما وقتي بچه ها بزرگ مي شوند،اوضاع جور ديگري است او از آنها خوشش مي ايد. بچه ها هم مي توانند با پدر گفتگوي درست و حسابي كنند و او هم مي تواند بچه ها را به تفكر در مورد مفهوم زندگي و موضوعات جدي ديگر وادار كند. سياره او مشتري است و مشتري باعث خوش خلقي اوشده ، او واقعاً اهل خوشمزگي است و وقتي حال و حوصله داشته باشد باعث مي شود بچه ها شادمانه از ته دل بخندند ."."\n"." متولدين اين برج معمولاً بلند قد و سفيد رو هستند و بسياري از آنهاپيشاني بلندي دارند. يادتان باشد هيچ وقت به آنها نگوييد كه دارند تاس مي شوند. !";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-dey")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد دی:"."\n"."نماد : جدی"."\n"." خداي من ! او كسي است كه مي داند كجا ميرود مستقيم رو به جلو!"."\n"." مردان متولد اين برج تلاش مي كنند تا پيشرفت كنند . سياره آنها كيوان است ، كيوان فرمانروايي جدي است و توسط حلقه هايي احاطه شده. پس متولد اين برج با حلقه هاي خودش محدود شده است. آنها دقيقاً مي دانند چه كاري را مي توانند انجام دهند و آن را به خوبي انجام مي دهد، نه كمتر و نه بيشتر . اين مردان محدوديتهاي خود را شناخته و آنها را رعايت مي كنند كه گاهي به موفقيتي عظيم مي انجامد . در مواقعي ديگر نگراني ها از اوآدمي خشك مغز مي سازند و او قدم از قدم بر نمي دارد و خطر نمي كند و با قوانين دستورات خود را محدود مي كند ."."\n"." اين مردان و پول مثل قفل و كليد باهم جورند."."\n"." متولد اين برج تحت تأثير نشانه خود دقيقاً محافظه كار هستند و هميشه خوش نامي دارند . آنها نگران عقايد مردم هستتندو سعي مي كنند در هر كاري اصول و مقررات جاري را رعايت كنند . فكر نكنيد آدمهاي كسالت آوري هستند ، نه واقعاً اين طور نيست. آنها به پدر اهميت زادي مي دهند و فكر مي كنند سايه پدر همچون روح هميشه بر بالاي سر آنها پرواز مي كند,(هملت را به خاطر مي آوريد.) شكايت عمده آنها احساس گناهي است كه زجرشان مي دهد ، مرد متولد اين برج حتماً اگر پايش را جاي پاي پدر بگذارد باز هم از غصه اينكه وظيفه اش را در مقابل پدر به خوبي انجام نداد ، او را غذاب مي دهد. اگر اين نگراني ها ريشه دار باشند اعتماد به نفس او را تضعيف كرده و خرد مي شود. اما اگر همين حس مسئوليت پذيري را در راه درست به كار برد، قوي و قويتر مي شود . آن وقت آسمان آخرين مرز محدوديت اوست. به دليل احساساتي كه نسبت به پدرش دارد. خودش نيز پدري فعال و سخت گير خواهد بود. وقتي احساس شادماني كند، بچه ها را دو چندان شاد مي كند و در مواقع ديگر پدري بسيار عاقل است . وقتي بچه ها تكاليفشان را انجام مي دهند مصمم و قاطع بالاي سر آنهاست و آنها را كنترل مي كند وقتي پدر بزگ شود، هر چند مي گويد شصت ساله است ولي مثل شانزده ساله ها رفتار مي كند."."\n"." مرد متولد برج دي گاه معتاد به كار است. ولي بهتر است قبل از آنكه شما او را با سامسونت ، كامپيوتر و ماشين حسابش تنها بگذاريد، تمرين كند با آنها به گردش برويد و نشان دهيد چقدر به آنها اهميت مي دهيد."."\n"." مرد و زن متولد اين برج بسيار دلچسب يا ترش رو، شيك و چشم و گوش باز يا ژوليده پوليده و بدبو باشد. برخي از آنها وقتي راه مي روند مثل سطل زباله اي هستند كه روي دوپا راه مي رود ، برخي از اين مردان از حمام كردن اكراه دارند و فكر مي كنند اگر در رگبار گير بيافتد، تايك هفته حمام نمي خواهند ! پيش  از انكه بازو به بازوي او قدم بزنيد يا براي بيني تان گيره لباس تهيه كنيد بايد بدانيد كه همه آنها اينطور نيستند ! بعضي بسيار تميز و مرتب هستند و بوي خوش ( ونه عطري مزخرف ) از خود در هوا مي پيچد."."\n"." چه تميز چه كثيف مردان متولد اين برج معمولاً لاغر و تيره و اغلب كوتاه هستندو كوتاهي قد را با بزرگي شخصيت جبران مي كنند. سن آنها در جواني بيشتر به نظر ميرسد . اگر 15 ساله باشند سي ساله به نظر مي رسند ، اما وقتي به سي سالگي ميرسند در جا مي زنند. و به آرامي پير مي شود.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-bahman")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد بهمن:"."\n"."نماد : دلو"."\n"." او جذاب ترين مرد در طالع بيني است .هم مرد و هم زن متولد اين برج مثل آهن ربا مرد مرا به خود جذب مي كنند. آنها اغلب از سن چهل سالگي چاق مي شوند. مرد متولد اين برج از ويژگيهاي آسماني و هيكل خوبي برخوردار است و باعث مي شود كه خيلي ها دچار تپش قلب شوند."."\n"." وقتي بفهمد او همان كسي است كه شما به دنبالش هستيد، در جهت مخالف شما مي دود.  او را در هر گروه يا انجمني مي توانيد پيدا كنيد مطمئن باشيد كه عضو هر گروهي باشد، به نحو شايسته اي عمل مي كند در ضمن او روابط عمومي خوبي دارد و دوستان زيادي پيدا مي كند. بطور كلي او كسي است كه مي توانيد در حاليكه در گفتگوي مهمي شركت كرده، خوب گوش دهد و بفهمد كه در آن سر سالن چه اتفاقي مي افتد."."\n"." او بسيار تيز بين است اما وقتي نوبت به مسايل عاشقانه مي رسد مثل خفاش كور مي شود. اما در مورد معجزه‏ات عقلاني صحبت كنيد، او بهترين است."."\n"." پسرهاي متولد اين برج در سنين پايين خانه را ترك مي كنند تا بالهايشان را باز كنند و در آسمان پرواز كنند. آنها مي خواهند چيزهاي جديدي ياد بگيرند. اين مردان عاشق ورزش هستند، انها از شطرنج لذت مي برند و از آنجا كه مي خواهند از مغزشان استفاده كنند حتي ممكن است تمبر جمع آوري كنند . آنها دوست دارند كه ديدشان را وسيع تر كنند و براي شر و ور گفتن در مورد ديگران وقت ندارند ."."\n"." مرد متولد اين برج فوق العاده رك است. وقتي بدخلق است ، به طعنه رك مي شود. در چنين مواقعي در مقابل اظهار نظرهاي او بايد پوست كلفت باشيد. گاهي آنقدر سرد و يك دنده مي شود كه بدجوري از دستش ناراحت مي شويد."."\n"." بسياري از مردم با مردان متولد برج بهمن مشكل عاطفي پيدا كرده اند و پس از اين تجربه غمگينتر و عاقلتر شده اند . و قبول كرده اند كه  شكست خورده اند.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hm-esfand")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "مرد متولد اسفند:"."\n"."نماد : حوت"."\n"." تا به حال دقت كرده ايد كهگاهي افرادي كه در يك زمينه خاص كار مي كنند متولدين يك برج هستند؟ مثلاً همه پزشكان متولد شهريوز باشند. شغل بعضي ديگر هم كارگرداني برنامه هاي تلوزيوني و يا ويراستاري روزنامه هاست. آنقدر حساس هستند كه مشاغل و حرفه هاي جذاب و هنري مناسب آنهاست."."\n"." مردان متولد برج اسفند حال و هوايي دارند كه ديگران را مثل زنبور عسل در اطراف ظرف عسل، به خود جذب مي كنند. سياره آنها نپتون است در اساطير رومي خداي درياهاست و مردان متولد اين برج ذاتاً كم حرف و قوي هستند. چون كمي عجيب و غريب و غير عادي هستند، مردم و بويژه زنان مجذوب آنها مي شوند."."\n"." عليرغم احساسات سست و خيالي، مرد متولد برج اسفند ، باهوش و ذكاوت خود در كارش پيشرفت مي كند. نپتون به او رفاقت ، صفا و صميميت آموخته است از اين رو متولد اسفند مي تواند ديگران را مجذوب و متحير كند."."\n"." اگر توي دست و بالتان چنين مردي داريد، او را از دست ندهيد بويژه اگر رمانتيك هم است. او به شما عشق مي ورزد، دوستتان دارد، كاملاً با شعور است و وضعيت روحي شما را درك مي كند و با شما طوري رفتار مي كند كه احساس مي كنيد واقعاً زن هستيد."."\n"." برخي از اين مردان به دنبال زني هستند كه از خودشان قوي تر باشد تا بتوانند به دنبال دنياي رويايي خود بروند. او از اينكه اوضاع را تحت كنترل خود داشته باشيد. خوشحال خواهد شد ."."\n"." بعضي از مردان متولد برج اسفند علاقه زيادي دارند كه دوست همه باشند. اما روبرو شدن با مسئوليت ها و وظايف به نظر آنها غير ممكن مي رسد. اينجاست كه يك مرد اسفندي نقاب از چهره بر مي دارد پشت نقاب دوستانه و غلطاند از او، مردي دو رو ظاهر مي شود كه شما را مات و مبهوت مي كند."."\n"." گاه مردان متولد برج اسفند پيش دوستان از همسر خود شكايت مي كنند كه همسر خشك و بي احساس شان آنها را درك نمي كند. ( در واقع آنها را به خوبي هم درك مي كنند!)  مرد متولد اسفند گاهي دنيا را طاقت فرسا و غير قابل تحمل مي داند و اين مهم او را آنقدر براي روي آوردن به موارد مخدر مستعد مي كند."."\n"." از آنجا كه حوت يكي از نشانه هاي رواني و آبي و نيز مملو از احساسات است، مرد متولد اين برج احساسات شما را به خوبي درك مي كند. او از ابراز احساسات نسبت به بچه ها ابايي ندارد و بچه ها را به خود جلب مي كند. او از لحاظ جسمي و عاطفي بيش از مردان متولد برجهاي ديگر براي پدرشدن مناسب است. او خيلي فداكار است و محبت و گرما از او مي بارد و نمي خواهد مثل مردان متولد برجهاي ديگر جاهل مآب باشد كه اين هم ويژگي خوب ديگري است.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			elseif ($data->text == "hz-farvardin")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد فروردین:"."\n"."نماد : حمل"."\n"." دوشيزه هاي مريخي جذاب هستند و قدرتهاي ويژه اي دارند و بيش از همتاي مردشان در بدست آوردن دل ديگران موفق هستند . اين زنان حين ورود به يك اتاق ، با صراحت لهجه و صداقت جمع را مجذوب خود مي كنند . بعضي به آنها بدگمان مي شوند و برخي آنها را دوست دارند زنان مريخي را مي توان از رنگ لباس شناخت . آنها مثل ماشينهاي آتش نشاني  از سر تا پا قرمز مي پوشند ."."\n"." بهتر است قبل از آنكه تصميم بگيرند بچه دار شوند ، شغلي براي خود انتخاب كنند تا جنب و جوش و تحرك داشته باشد و بتوانند از اين طريق شور و شوق هميشگي خود را ابراز كنند . در غير اينصورت پس از ازدواج احساس مي كنند محدود شده‏اند ( او در همه حال خواهان آزادي است ) و بحران از اينجا آغاز ميشود . او فمينيست سر سختي است و با چنگ و دندان با شوهرش مي جنگد . او زن خانه دار معمولي نيست و هيچ مردي نبايد تلاش كند از او زني خانه دار بسازد . دختر متولد اين برج بسيار مستقل است . او همانطور كه خود را به ديگران نشان مي دهد ، مرد مناسبي را براي ازدواج پيدا مي كند و ازدواج او از همه حيث تمام و كمال خواهد بود ."."\n"." با اين كه فرزندانش تا زماني كه با او زندگي مي كنند ، او را محدود مي كنند ، ولي او مادر خوبي براي آنهاست و درست زماني كه آخرين بچه خانه را ترك كند، نهايت لذت را از زندگي خواهد برد . به كلاسهاي هنري ميرود و به فعاليتهاي هنري مي پردازد . از آنجا كه متولد اين نشانه در پي منافع خود است و به آزادي هاي زيادي مي دهد، پس دختران متولد اين برج نبايد در سنين پايين محدود شوند. او قبل از شناخت ديگري و علاقه به او ، اول بايد خود را بشناسد كه شايد سالهاي سال به طول انجامد . اگر در نوجواني و اوايل جواني گرفتار و محدود شود . شايد سي سال بعد تسليم طبيعت شتابزده خود شود و زندگي زناشويي اش در معرض خطر قرار گيرد."."\n"." اين زنان سرشار از شور و نشاط ، محبت و شگفتي هستند و مي خواهند نقش مهمي را در زندگي بازي كنند . علاقه آنها به ديگران از آنجا ناشي مي شود كه قوچ هستند و رياست طلبي آنها به اين علت است كه تحت سلطه مريخ‌ ـ سياره رياست طلبي ـ به سر مي برند ."."\n"." دختر متولد فروردين اگر مرد مناسبي را پيدا كند ، وقت را تلف نمي كند ، پا پيش مي گذارد و حتي يك قدم هم به عقب نمي رود. او مثل همتاي مردش گاهي خوش شانس است و گاه نيز معشوق رويايي اش همچون خرگوش گريز پا با وضع نااميد كننده اي فرار مي كند . متولدين اين برج هميشه باريك بين و آگاه نيست و ممكن است با گزافه گويي ( لاف و گزاف) افراد حساس را فراري دهد ."."\n"." دختر فروردين در ظاهر سرزنده و زود رنج است اما در باطن بسيار كمال گراست و در يك روز واقعاً گرم بسيار احساساتي است اين دختر اگر بفهمد شريك او گرگي در لباس بره است ، قيافه غم انگيزي پيدا مي كند . او خيلي آسيب پذير است و سعي مي كند آن را پنهان كند ."."\n"." نشانه هاي آبي و خاكي به امنيت خانوادگي نيازمندند اما زن مريخي بايد از كساني كه دوستشان دارد جدا باشد تا بتواند خود را بشناسد . او بايد در اجتماع باشد تا اجتماعي شود . اگر اين دختر زماني را به خودش اختصاص ندهد از روابط بيزار و متنفر مي شود، داد و هوار و گريه مي كند و زبانه آتش خشم او بيش از توده آتشي است كه در يك قوطي كبريت مي بينيد."."\n"." قوچ ماده تركه اي نيست اما خوش بنيه است ."."\n"." باور نمي كنيد ؟ او را در نظر بگيريد .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-ordibehesht")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد اردیبهشت:"."\n"."نماد : ثور"."\n"." يك جلسه زنانه سرزده ايد، مطمئن باشيد رئيس جلسه حتماً زن متولد ارديبهشت است او احتمالاً چند شيشه ترشي و يا مربا نيز به همراه دارد ."."\n"." مي پرسيد از كجا مي دانم ؟ خوب اگر ونوس را پديد آورنده خوبي ها ، صاحب تجمل و  تأمين كننده آذوقه بدانيم ، زن متولد ثور را پيش رو داريم . زنان متولد اين برج به راستي خانه دار هستند . آنها نگران برچيده شدن ريشه هاي دايمي زندگي و مشغول ايجاد پايه محكمي براي آن هستند . ثبات بهترين واژه براي متولدين اين برج است . هرچيز بي ثبات و موقتي ولو بسيار كوچك ، آنها را دچار دلشوره مي كند ."."\n"." گاهي دختر متولد اين برج ، مثل ميوه درخت بلوط كه بر بلندترين درخت هاي بلوط رشد مي كند و هما نجا مي ماند ، تا قبل از ازدواج با والدينش زندگي مي كند . اين را به حساب تنبلي يا نداشتن قدرت تخيل نگذاريد، او فقط به خانواده دلبسته است و نمي خواهد از آنها دور شود ."."\n"." از نظر او هر چيز ملموسي ، فوق العاده  است . اين نشانه در طالع بيني مادر زمين  (ارديبهشت) كاملاً محسوس است . يك زن واقعي متولد ارديبهشت همسر شاد يك كشاورز است . روي زمين كشاورزي مي كند و روزهاي زندگي اش را در هماهنگي كامل با طبيعت سپري مي كند . زن متولد اين برج لوند نيست چون زندگي را خيلي كوتاهتر از اين مي پندارد كه بخواهد عشوه گري كند و در مقابل مي تواند بسيار ساده لوح و خجالتي باشد . او هيچ دليلي نمي بيند كه تا وقتي مي تواند براي انجام يك كار ورجه  ورجه و شيطنت كند ، بنشيند و فس و فس كند . او مي تواند خيلي آرام و وسوسه انگيز باشد . تخت خواب او هميشه با ملحفه هاي ابريشمي نرم پوشيده شده و حمام او پر از صابونهاي بسيار خوشبو است. وقتي ازدواج مي كند ، همسر، منزل ، آشپزخانه و فرزندانش بسيار مهم مي شوند و بيشترين تلاشش را مي كند تا همسر و مادري كامل باشد . از نظر او وفاداري يعني همه چيز به همين دليل از همسرش نيز انتظار دارد كه مثل خود او وفادار باشد ."."\n"." اينها ويژگيهاي مثبت شخصيت او است. اما از نظر ويژگيهاي منفي او را دست كم نگيريد چراك ه از اين نظر مي تواند بر همه نشانه ها به جز عقرب پيشي بگيرد. او از رشك و حسد هم بي بهره نيست. از اين دختر انتظار نداشته باشيد كه ببخشد و فراموش كند، چون در سرشت او نيست . او با خونسردي تصميم مي گيرد تا با كسي كه به او بد كرده، هيچ كاري نداشته باشد .و دليل اين خيلي ساده است چون اين روش محافظه كارانه براي آن است كه در آينده مجدداً‌ از همان ناحيه آسيب نبيند ."."\n"." همچون همتاي مردش، وجود ديگران، بويژه نزديكترين و عزيزترين فرد برايش عادي ميشود . او سرد و بي روح نيست اما احساساتش را بدرستي بيان نمي كند و فراموش مي كند همسرش نياز دارد كه نظر و احساس او را نسبت به خود بداند و گاه خيلي دير ( درست وقتي كه او مي خواهد تركش كند)، ‌به اين نكته مهم پي ميبرد . اگر موقعيتي پيش آيد كه او مدتها از همسرش دور باشد فقط به فرستادن يك كارت پستال سال نو اكتفا مي كند. به اين دليل هميشه مورد سرزنش قرار مي گيرد همسرش، پرخاش ميكند و مي خواهد بداند كه چرا هيچ وقت نگفته او را چقدر دوست دارد. اما زن متولد ارديبهشت مات و متحير است و آهسته نجوا مي كند ، نيازي نيست كه بگويم همين كه با تو هستم بيانگر همه چيز است. ولي خوشبختانه قبل از آنكه خيلي دير شود ، مي فهمد كه هر سردي  كدورت با كمي عشق و احساسات بر طرف مي شود ."."\n"." زن متولد اين برج بسيار جذاب است و گاهي نيز ژست اغراق آميزي به خود مي گيرد. سياره ونوس به انها صداي خوبي نيز بخشيده است تا جايي كه مي توانند خواننده هاي معروفي شوند."."\n"." از آنجا كه زن متولد برج ثور مادر زمين است مي تواند مادري بسيار خوب براي فرزندانش باشد . او عاشق آنهاست هيچ گاه آنها را سرزنش نمي كند  در عوض خيلي به آنها عشق مي ورزد. او مي تواند بسيار حسود باشد و اجازه ندهد بچه ها خانه را ترك كنند و بالهايشان را باز كنند و پرواز كنند . او از تنبيه بچه ها پرهيز مي كند و فقط به آنها عشق مي ورزد و اين همان چيزي است كه او را يكي از گرمترين و صميمي ترين نشانه ها در آسمان فلكي ساخته است .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-khordad")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد خرداد:"."\n"."نماد : جوزا"."\n"." زن متولد خرداد معتقد است ماهي براي مغز مفيد است اگر مي خواهيد او را شيفته خود كنيد يك بشقاب ماهي را تا ته بخوريد!"."\n"." او پول زيادي بابت هزينه پستي مي پردازد و هميشه هم به تنهايي به پستخانه مي رود . اگر شما دوست او هستيد از دريافت يك خروار كارت پستال و يادداشتهاي كوچك او خوشحال خواهيد شد چون او دايماً با شما در تماس است . دفترچه يادداشت او پر از قرار ملاقات ، برنامه و وظايف اوست و اگر مي خواهيد او را ببنيد، حتماً دو هفته قبل وقت ملاقات بگيريد . او عاشق ديدن نمايشهاي جديد ، آخرين فيلمها و خواندن جديدترين كتابهاست و كسي است كه با رضايت كامل با شما به گردش هاي هنري ، علمي ، تفريحي يا ورزشي مي آيد ."."\n"." بعضي از مردم مي گويند كه زن متولد خرداد معمولاً شايعات خوبي براي گفتن دارد و مي شود اعتراف كرد كه خبرهاي بي مزه و يا چرت و پرت نمي گويد . خبرهاي او بسيار وسوسه انگيز و داغ و مربوط به مسائل روز است . توصيه مي كنم هيچ رازي را به او نگوييد ، چون مطمئناً كمي دور خودش مي چرخد ، چاي دم مي كند و براي پخش خبر جديد به يكي از دوستان تلفن مي كند ."."\n"." زن متولد برج خرداد دوست دارد بلوز و شلوار راحتي بپوشد . او قلباً‌ فمينيست است و عقيده دارد كه زنان از هر نظر با مردان مساوي هستند و او نيازي ندارد كه زنانگي خود را با زلم زيمبو و يا لباسهاي چين واچين ثابت كند بلكه مي خواهد  او را فقط به خاطر خود و افكارش دوست بداريد بنابراين خود او نيز به ذهن شما بيش از ظاهرتان علاقمند است ."."\n"." بيشتر زنان متولد خرداد بسيار سرشناس هستند . اگرچه برخي مي گويند آنها آدمهايي سطحي هستند ، اما در واقع اينطور نيست. او بر خلاف اين آنها خود را به سرعت با محيط وفق مي دهند. آنها همانطور كه در بحثها در مورد موضوعات اصلي و شاخه هاي فرعي صحبت مي كنند ( چون آنها عاشق بحث و مذاكره هستند ) به راحتي هم مي توانند موضوع را عوض كنند. دوستان يك زن خرداد توصيفهاي مختلفي از او دارند. گاهي معتقدند او شبيه آفتاب پرست است و تحت تأثير محيط و افراد مختلف رنگ عوض مي كند. اما بطور كلي بهترين ويژگي او اين است كه حتي اگر سعي كنيد به هيچ وجه به ذهن او راه نخواهيد يافت. فقط مي دانيد كه هفت روز هفته هر روز بيست و چهار ساعت كار مي كند . اگر زندگي يا حتي اتاق خود را با او تقسيم كرديد مطمئن باشيد شادي او در تمام ساعات شبانه روز شما را مات و متحير مي كند ."."\n"." فكر نمي كنم كه زن متولد اين برج مادر خيلي خوبي باشد ، او هم مثل همتاي مردش بچه ها را وقتي دوست دارد كه بزرگ مي شوند و زبان باز مي كنند و به جاي اينكه خودش بچه دار شود و يكي دو سال خود را به زحمت بياندازد و هر سه ساعت يك بار بچه را تر و خشك كند و در تختخواب بگذارد ، ترجيح مي دهد كودكي را به خانه بياورد و به فرزندي بپذيرد!"."\n"." رفتار او اصلاً مثل مادرها نيست. اگر براي بچه ها آشپزي كند ، لطف زيادي در حق آنها كرده و بچه ها بايد خيلي هم خوشحال باشند . او بيش از تغذيه جسم، به تغذيه مغز آنها اهميت مي دهد و بچه ها را به سوي آموختن سوق مي دهد و براي آنها داستان مي خواند و آنها را تشويق مي كند كه عاقلانه فكر كنند . اگر بچه ها بخواهند مادر آنها را در آغوش خود بگيرد ، احتمالاً دلسرد و نااميد مي شوند ، اما اگر بخواهند آنها را نصيحت كند ، حتماً به آنها كمك خواهد كرد .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-tir")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد تیر:"."\n"."نماد : سرطان"."\n"." عجب نشانه رضايت بخشي است ! تير يكي از بهترين برجها براي تولد زنان است ."."\n"." دختر متولد برج تير بسيار حساس است و از نيروهاي مرموزي دراين زمينه برخوردار است .  دختر متولد تير نسبت به واژه ها حساسيت خاصي دارد و لازم است كه به احساسات و عواطف خود آگاه باشد و به آنها نظم دهد ، چون در غير اينصورت مثل تكه هاي از هم گسيخته يك قايق شكسته، در درياي زندگي به اين سو و آن سو مي رود . او مي تواند چون يك آتشفشان دچار فوران احساسات شود و اطرافيان را بترساند و گاهي نيز چنان درگير حسادت مي شود كه به فرار از چنگال او براي همه مشكل مي شود ."."\n"." زن متولد تير، خيلي يك دنده است و اين خصلت او گاه دوست داشتني است چون سماجت او را در رسيدن به خواسته هايش كمك مي كند اما از نظر عاطفي ، افتضاح است چون نمي داند چه وقت ، كجا و چرا توقف كند . او قادر نيست بفهمد يك رابطه كي تما م شده و اگر تصويري مبهم و نادرست از پايان رابطه داشته باشد آنقدر سماجت مي كند و به طعمه و چنگ مي زند تا عشق و علاقه هر دو طرف به نفرت تبديل شود ."."\n"." احساسات او گاه به حد افراط مي رسد و به جاي آنكه از او آدمي عاشق ، مهربان ، دلسوز ، آرام ، فادار ، محافظ و رام بسازد ، آشفتگي به بار مي آورد . او از نظر ديگران آدمي مرموز، دسيسه چين و زود رنج است . در واقع ديگران احساسات او را بد تعبير مي كنند و تلاش مي كنند تا از او دوري كنند اما احساسات و دلبستگي هاي او بسيار قوي است و تمام اين سوء تعبيرها ناشي از غرور اوست ."."\n"." اين زن اگر آدم مثبتي باشد ، بسيار همدل، پر احساس و ياري بخش است واگر احساساتش را بدرستي جهت دهد و خود را به شكلي درست و غير مستقيم وقف شريك كند همه چيز عاشقانه پيش خواهد رفت. اما، امان از وقتي كه همه چيز را خراب مي كند ، گريه و شيوني سر مي دهد كه آن سرش ناپيدا است."."\n"." زن متولد تير اگر وجودش را سازمان بخشيده باشد ، محشر است . او از شريك خانواده و هركس كه برايش مهم است ، صادقانه و با نظم و مقررات خاص  محافظت مي كند . او در موقع لزوم ديگران را توبيخ نيز مي كند .ا گر او منفي باشد خجالت مي كشد كه ديگران را مواخذه كند، البته زن متولد تير پس از نطق آتشين ، يا دعوا با ديگران خود خوري مي كند و فكر مي كند آيا كارش درست بود يا نه و حسابي گريه خواهد كرد , مهم اين است كه او بلاخره نظرش را مي گويد و عاقلانه عمل مي كند ."."\n"." بيشتر زنان متولد تير جمع و جور و خوش هيكل هستند . برخي هم به شكل دلچسبي خپل هستند ."."\n"." دختر متولد چهارمين برج در منطقه البروج معمولاً زياد لبخند مي زند. او گرم و خودماني است و رفتاري مادرانه دارد. از اين رو بودن در كنار او ، لذت بخش است . او دوست داشتني است و عاشق بچه است و اگر بچه نداشته باشد او يك حيوان خانگي نگهداري مي كند."."\n"." اشتباه نكيند ، زندگي خانوادگي مانع روشنفكري او نشده است . او مي تواند در عين همدلي و منطق فمينيست باشد ، و در اين مورد مانند متولدين برخي برجها سرسخت تند و متعصب نيست ."."\n"." بي شك او بهترين مادر است اما از آنجا كه انحصار گري در خون اوست، جدا شدن بچه ها از خانواده ، وي را دچار دلشوره مي كند . چون جدا شدن از خانواده براي خودش هم سخت بوده است . حتي وقتي بزرگ مي شود بيشتر وقتش را با ايل و تبارش مي گذراند . نمونه بارز اين زن ، رئيس من است كه بيشتر وقتش را با خانواده مي گذارند چون زندگي اش حول كسب و كارش مي چرخد . مثل بقيه زنهاي متولد اين برج وقتي اسم دوستانش را بپرسي، از تعداد انگشتان دست تجاوز نمي كند .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-mordad")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد مرداد:"."\n"."نماد : اسد"."\n"." اگر مي خواهيد در زندگي شاد باشيد و برقصيد ، به دنبال دختر متولد برج مرداد برويد . اسد نشانه هنرپيشگان و خوانندگان معروف است و بيشتر زنان متولد اين برج هم عاشق بازيگري هستند ."."\n"." زنان متولد اين برج از بسياري لحاظ ملكه هاي نمايشي و اغلب خوشگل هستند . ( خدا به فريادتان برسد اگر به او بگوييد خوشگل نيست ، حتي اگر حوشگل هم نباشد هيچ وقت نگوييد . ) او موهايش را افشان مي كند و كلاه بزرگي بر سر مي گذارد."."\n"." زن متولد پنجمين برج سال عاشق دوست داشتن است. دوست دارد عشوه بيايد و ديگران را به دنبال خود بكشاند ، و آنها لي لي به لالايش بگذارند . فرقي نمي كند كه شمادر ظاهر او چه مي بينيد ، درون چنين زني گربه اي است كه مي خواهد ناز و نوازش و ستايش شود . او زني است كه نه تنها در تأمين معاش خانواده كمك مي كند بلكه از بچه ها هم مراقبت مي كند ."."\n"." اگر همسر شما متولد مرداد است به خاطر داشته باشيد كه نمي توانيد به او بي توجهي كنيد او خود شيفته است و عاشق اين است كه ببيند روي ديگران چه تأثيري مي گذارد ."."\n"." او مادري است كه عاشق فرزندانش است و به بچه ها بيش از هر چيز ديگري در زندگي اهميت مي دهد . او سخت گير نيست و به فرزندانش آزادي زيادي مي دهد."."\n"." او زندگي مرفه ، گشت و گذارهاي دست جمعي و رفتن به مهماني با شما را مي پسندد . اگر كاري را به تنهايي انجام دهد، يقيناً در حوزه زناشويي به مشكلي برخورده است در غير اينصورت بايد دليلي محكم براي غيبت همسر وجود داشته باشد . او مي تواند قبلاً به علت كمر درد در خانه استراحت كند ."."\n"." او به همراه شما به ميهماني مي آيد و خوش مي درخشد . زن متولد مرداد در كانون توجه و مورد  ستايش مردان قرار مي گيرد . اما بايد بداند كه اگر شوهرش متولد ارديبهشت است بهتر است كمتر اين بازي را تكرار كند تازه اگر همسرش نيز متولد مرداد است بايد حوايش را بيشتر جمع كند كافي است شوهرش بفهمد مردان ديگر به همسرش علاقمندند، آنوقت جنجالي به پا خواهد شد. عكس اين قضيه هم صادق است در واقع زن متولد مرداد هم چنين رفتاري را از شوهرش نمي پذيرد ."."\n"." اگر مي خواهيد روي او تأثير مثبت بگذاريد وي را به بهترين رستوران شهر ببريد و اگر پول دوست و خسيس هستيد ، هيچ وقت به دنبال او نرويد چون خون شما را در شيشه مي كند ."."\n"." اگر قصد ازدواج با او را داريد اين را هم بدانيد كه افاده اي ، اهل چشم و هم چشمي هاي پر زرق و برق و تجملي است و به دنبال مثلاً فلان زنجير طلا مي گردد . او كسي است كه در هواي خيلي گرم كت پوست مي پوشد و در حالي كه از شدت گرما در خيابان تلو تلو مي خورد جواهراتش را به نمايش مي گذارد . برق جواهرات و سنگهاي قيمتي او كه حتماً شامل الماس ، ياقوت قرمز و كبود است ، چشمتان را كور مي كند . موهاي او هميشه مرتب و آرايش كرده است . او اصرار دارد كه مشتري پرو پا قرص بزرگترين و گرانفروش ترين فروشگاهي كه مي شناسد، باشد . وقتي صورت حساب خريدش را براي شما مي آورد . احتمالاً‌دچار حمله قلبي مي شويد ."."\n"." به هر حال اگر شيفته زني شيك و هميشه آرايش كرده هستيد ، فقط به دنبال زن متولد مرداد باشيد .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-shahrivar")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد شهریور:"."\n"."نماد : سنبله"."\n"." مهمترين نشانه در طالع بيني زن متولد شهريور باكرگي،‌ دوشيزگي، و طبيعي بودن است و همين براي توصيف دختر متولد اين برج كافي است."."\n"." دختران متولد اين برج بطور كلي هيچ وقت مثل مردم ديگر رفتار نمي كنند. نه عصباني مي شوند و دردسر درست مي كنند و نه يك دفعه غيبشان مي زند."."\n"." او عمداً مي خواهد كه مثل طبيعت به نظر برسد. (نه منظور من اين نيست كه او لباس نمي پوشد و سخت است) او ندرتاً آرايش مي كند. اگر زني روستايي باشد ، مطمئن باشيد از ريشهء گشنيز و كرفس يا چيزي شبيه به آن ، مواد آرايشي درست كرده و مصرف مي كند."."\n"." او مادر محشري است. براي او خيلي مهم است كه بچهء باهوشي داشته باشد. اما بايد بداند كه بچه همان اندازه كه به آموزش و يادگيري نياز دارد به عشق و محبت هم نيازمند است. زن شهريور بايد به خاطر داشته باشد كه گاهگاه كتابش را كنار بگذارد و كودك را در آغوش بگيرد. او يك ريز به دنبال علايم هوشمندي در نوازادش است و حتي شايد گاهي فكر كند كه نوزاد كوچولو از نظر هوش مشكل دارد! در عين هر كاري كه بتواند براي بچه انجام مي دهد و از سپيدهء صبح تا بوق سگ از او پرستاري مي كند."."\n"." يادتان باشد كه او خوددار است. پس انتظار نداشته باشيد كه مثل متولدين برجهاي آبي ناگهان فوران كند ، يا مثل دخترهاي متولد برج اسد و ميزان جذاب و لوند باشد. در عوض چشمهاي او تمام مدت شما را به دقت نگاه مي كند و سعي دارد به كنه وجود شما پي ببرد."."\n"." پشتكار او سبب مي شود كه دستيار خوبي باشد و هر رئيسي به او واقعاً اعتماد كند. او فمينيست سرسختي است ولي مي خواهد كه او را مثل يك انسان باهوش با حقوق خودش بپذيريد."."\n"." در زندگي برخي از زنهاي متولد اين برج لكه هايي هست كه دوست دارند آنها را مثل غلطهاي تايپي با غلط گير پاك كند و اگر موفق شود از خوشحالي بال در مي آورد.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-mehr")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد مهر:"."\n"."نماد : میزان"."\n"." زن متولد برج مهر مثل هلويي است كه روي دو پا راه مي رود. برخي از متولدين مهر آنقدر زيبا هستند كه نفس آدم بند مي آيد. البته شايد روزي عجوزه اي پير ، مخوف و عجيب و غريب هم در بين آنها پيدا كنيد . ( شك نكنيد او هم فكر مي كند كه زيباست . ) دختران متولد اين برج قشنگترين دختران در كهكشان راه شيري هستند.  آنها طبيعت زيبايي دارند."."\n"." دختر متولد برج مهر طوري لباس مي پوشد كه هم چيز با هم بخواند. او شيك است ، حتي اگر شلوار جين كهنه اي بپوشد ، مطمئن باشيد كه تميز است و به پليور يا تي شرتي كه مي پوشيده ، مي آيد . او شيفته مد است تا جايي كه گاهي طراح لباس مي شود."."\n"." او از مصاحبت ديگران لذت مي برد و ندرتاً زمان زيادي را به تنهايي مي گذارند . اگر تنها زندگي كند ( كه دور از انتظار است .) دوستان زيادي دو و برش دارد. او از جهاتي به زن متولد مرداد شبيه است . زن متولد مهر مي خواهد تا جايي كه ممكن است با كمترين زحمت ، از ميهمانها به بهترين نحو پذيرايي كند. (او حتي بيسكويت را در ظروف لوكس سرو مي كند . )"."\n"." اگر روزي با دختري روبرو شويد كه بوي خوب شيريني مي دهد مطمئن باشيد كه متولد برج مهر است . او عاشق بوي شيريني است . اگر مي خواهيد به قلب او راه پيا كنيد يك شيشه عطر و يك دسته گل به او هديه دهيد. فراموش نكنيد كه رنگ گلبرگها با رنگ بسته عطر جور باشد . او از هماهنگي رنگها لذت مي برد. اين دختر معمولاً يك دسته گل نزديك سوراخ بيني اش مي گيرد ."."\n"." اگر روزي او را با كثيف ترين و ژوليده ترين لباس ها ديديد ، بدانيد كه او حتماً دچار بحران شده است (مگر آنكه هميشه همينطور باشد.) و مشكل اصلي او بگو مگو با شريك زندگي است ."."\n"." زن متولد اين برج ذاتاً مادر نيست هرچند كه بيشترين تلاشش را مي كند . با اين همه او مادري است كه يك دفعه ناپديد مي شود. زن مهر بايد ياد بگيرد كه مهر و محبت را از خانه شروع كند. در مواقع نادر كه در خانه به سر مي برد مادري دوست داشتني است. وقتي بچه ها زبان باز مي كنند ، خوشحال تر مي شود. او بچه ها را از سنين پايين با كتاب آشنا كرده و از ذهن آنها ذهني خلاق مي سازد. وي بهترين لباسها را به تن خود و بچه ها مي كند.  بو ، مهمترين چيز مورد توجه اوست حتي بوي بد نوزاد هم او را اذيت مي كند و مجبور مي شود نزديك لگن بچه دستگاه تهويه هوا كار بگذارد .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-aban")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد آبان:"."\n"."نماد : عقرب"."\n"." زن متولد برج آبان آدم سردي است. آرامش بيش از حد برخي اين از زنهاي افسونگر، شما را جادو مي كند، حتي ممكن است آزار بدهد و سرگردان كند. زمان زيادي طول مي كشد تا بفهميد او به چه چيزي شبيه است. مطمئناً ، او واقعاً همان دختر سرد و خوددار نمي تواند باشد . در واقع وظيفه شماست كه بفهميد او چيست :"."\n"." بيشتر زنان متولد آبان قشنگ ، وسوسه انگيز و فريبا هستند. حتي زماني كه كاملاً ساكت هستند ، چشمهاي آنها با صداي بلند با شما سخن مي گويد . آنقدر جذاب هستند كه دوستان به دورشان جمع مي شوند . شما هم با انرژي جالب، مبهم و مرموز او گرفتار مي شويد ."."\n"." در واقع عشق در تمام عناصر وجودي دوشيزه متولد اين برج نفوذ كرده . او با همه موضوعات احساساتي برخورد مي كند ، از طريق آويزان كردن جورابتان روي بند گرفته تا مشكلات جهان سوم ممكن است از آن دخترهايي باشد كه از نظر مردان خرفت است ،اما اگر در قلبش جايي براي خود باز كنيد‌. براي هميشه آنجا جاي شماست . او در قبال كسي كه دوست دارد بسيار صادق و وفادار است . سعي كنيد بر يكي از اين دخترها غلبه كنيد تاببينيد كه زندگي چگونه به روي شما لبخند مي زند ."."\n"." پيش از آنكه به خود غره شويد، فراموش نكنيد كه اگر پاي خود را از گليم تان دراز تر كنيد ، پشيمان خواهيد شد . هرگز فكر نكنيد كه مي دانيد به او خيانت كنيد ، چون با نگاهي زيركانه همه چيز را مي فهمد و چنان غيظ مي كند كه مجبور مي شويد همه چيز را پنهان كنيد . اگر با او درگير شويد ، هرگز شما را نمي بخشد و فراموش نمي كند ، او حتي در هشتاد سالگي هم از شما دلخور است ."."\n"." در آسمان فلكي او از متولدين نشانه هاي ديگر حسود، كينه توز، و انتقام جو تر است . مراقب باشيد كه او را خشمگين و غضبناك نكنيد . بعداً نگوييد كه نگفتم!"."\n"." وقتي مادر مي شود مثل ماده ببري است كه براي محافظت از بچه ها با چنگ ودندان مي جنگد . او مي تواند بسيار انحصار گر باشد و نگذارد كه بچه ها از چشمش دور شوند . مادرهاي خيلي منفي حتي نمي گذارند كه شخصيت بچه ها شكل بگيرد و اگر مراقب نباشند آشفتگي به بار خواهد آمد . از نظر دختران متولد اين برج فلسفه زندگي اين است كه اگر خداوند دري را ازروي حكمت ببندد ، در ديگري را از روي رحمت باز مي كند ."."\n"." اگر دختري مثبت و متولد آبان را انتخاب كنيد، روزهاي بسيار خوشي را با هم مي گذارنيد ، او چه دوست شما باشد چه شريك تان ، استواري غير منتظره اي از خود نشان مي دهد . خداي من ! او بي نظير است .";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-azar")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد آذر:"."\n"."نماد : قوس"."\n"." عجب زن مهرباني است ! با ذهن خلاق و قيافه بي شيله پيله اي كه دارد هيچ وقت عقب نمي ماند."."\n"." او دختر متجددي است و مي خواهد او را به خاطر خودش و نه براي موهاي بلند و بور يا چشمان آبي درشتش دوست بداريد . او معمولاً به اندازه پسر متولد اين برج آزاد و بي قيد نيست. اما گاهگاه مي خواهد فرار كند و برود. به خاطر بسپاريد كه نبايد وقتي شانزده سال دارد با او ازدواج كنيد . قبل از آنكه دست به كار امر خير شود بايد برود و دنيا را ببيند . در غير اينصورت بعدها ديسيپلين شما را نمي پذيرد و آشفتگي به بار مي آورند. اگر خيلي زود ازدواج كرده  والان احساس خفگي و سركوب مي كند بهتر است در كلاسهاي شبانه و يا دانشگاه مكاتبه اي ثبت نام كند."."\n"." او دوشيزه اي باانگيزه هاي مادرانه نيست . اما تمام تلاشش را مي كند تا فرزنداني باهوش تربيت كند. او به بچه ها احترام مي گذارد و آنها را نوازش مي كند . زن متولد آذر در تربيت فرزنداني مستقل، بي همتا است . او نه تنها مادري پير و امل نخواهد بود بلكه بچه ها را تشويق مي كند كه خودشان باشند. او آنقدر صادق است كه هميشه واقعيت را به بچه ها مي گويد . مهمترين بخش پيشرفت فرزندانش ، هوش آنهاست . فرزندان او آنقدر تيز هوش هستند كه از تك تك سلولها خاكستري مغزشان استفاده مي كنند ."."\n"." او فمينيست است و اگر بخواهيد با او هميشه از چيزهاي پيش پا افتاده صحبت كنيد. شعله هاي خلق آتشي خود را نشان مي دهد. به نظر خودش ، او زن است و حقوقي خاص خود دارد، زن متولد برج آذر از صحبت درباره عقايدش نمي ترسد و با تلاش كار خارج و داخل خانه را با هم تلفيق مي‏كند."."\n"." براي تحريك ذهنش بايد تمركز داشته باشد ، در غير اينصورت دمغ و پكر مي شود محدوديت براي كليه متولدين اين برج مضر است ، حتي اگر با آدمهاي كم هوش ازدواج كند و آپارتماني لوكس داشته باشد. اگر دختر متولد با كسي ازدواج كند كه نتواند او را به همان ترتيبي كه عادت داشته نگهداري كند بعيد نيست با اولين كسي كه از هوش كافي برخوردار است ، بپلكد."."\n"." فراموش نكنيد همه متولدين اين برج خانه به دوش هستند. در واقع خانه به دوش و خوشگذران هستند و ان دختر خواهان داشتن شريكي است كه مثل خودش به سفر علاقمند باشد تا در فروب با هم به گردش بروند ."."\n"." سياره متولد اين برج مشتري است و از آنجا كه مشتري سياره پرچانگي است . برخي از زنان متولد اين برج خيلي بيشتر از آنكه بتوانند عمل كنند، قول مي دهند . ماهها قبل وقتي از وضع مالي ام ناراضي بودم ، يك زن متولد اين برج پيشنهاد كرد هر وقت به پول احتياج داشتم، به من قرض خواهد داد وقتي به كف گير به ته ديگ خورد سراغ او رفتم تا كمك بگيرم. او گفت :  آه اگر ديروز گفته بودي ، داشتم، اما قبض گاز را پرداخت كردم و الان اصلاً پول ندارم. دختر متولد برج آذر در صحبتهايش دايماً از افراد سرشناس نام مي برد و شما را آماده مي كند تا هرچه مي گويد را باور كنيد ."."\n"." مي گفت كه ديشب در سالن سينما با هنرپيشه كه او را به اسم كوچك هم صدا مي زد، ملاقات كرده به نظر آمد حتي آنها با هم شام هم خورده اند ولي بعد شنيدم كه اصلاً فلاني آشنايي هم نداده است. حرفهاي او را زياد باور نكنيد تا به اشتباه نيفتيد و نيمه شايسته و تيز هوش اين آدمهاي مهيج را ببينيد.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-dey")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد دی:"."\n"."نماد : جدی"."\n"." عجب زن قدرتمندي ! از آنجا كه زن متولد برج دي آكنده از اقداري حيرت آورست و ديگران را به چند بار فكر وادار مي كند، برخي فكر مي كنند كه اوزني مرد نماست ، اما نيست."."\n"." جالب است بدانيد دختران متولد دي اغلب با مرداني شل و ول و گاه ترسو پيوند زناشويي مي بندند و به اين ترتيب رئيس نان آور خانه مي شوند. آنها احساس پدري هم مي كنند. البته همه آنها با آدمهاي ترسو ازدواج نمي كنند. اگر يك روز در فروشگاه زني را ديديد كه تند تند راه مي رود و شوهرش در حاليكه ساك خريد وي را در دست دارد، با عجله به دنبالش ميرود. مطمئن باشيد زن متولد دي را ديده ايد. برخي از اين دختران با مرداني ازدواج مي كنند كه پله هاي موفقيت را يكي پس از ديگري طي مي كنند ، آنها از ته دل به شوهر خود افتخار مي كنند، براي اثبات ادعاي مادر ستاره شناسي ، پيشنهاد مي كنم دفعه بعد كه سري به بانك زديد، دورو برتان را خوب نگاه كنيد پيرمردي را با دفترچه مستمري به همراه نوه خوشگلش مي بينيد . نه نه نه اشتباه نكنيد، آن خانم جوان زيبا همسر اوست و حتماً هم متولد دي است. زنان متولد دي مردان ميانسال را خيلي دوست دارند و در ازدواج گاهي به تفاوت سني 30 سال فكر مي كنند . آنها شوهري مي خواهند كه برايشان پدري كند ."."\n"." اما مادري دلباخته بچه هاست و مي خواهد آنها را در زندگي راهنمايي كند، خطرات را گوشزد كند و براي عبور از موانع به آنها كمك كند. گاهي فضول است و بيش از اندازه در كار بچه ها دخالت مي كند و مي خواهد بچه ها به خواسته هايي كه خودش داشته و نرسيده ، برسند. او بسيار دلسوز است و كمك بزرگي براي بچه هاست و هر وقت كه لازم باشد آنها را هل مي دهد."."\n"." او نمك زمين است، او مادري معركه است زني با محبت قاطع، منضبط، تابع مقررات و است. او مامان ، بايدها ست . گاهي آنقدر جدي مي شود كه درگيري به وجود مي آورد، بويژه وقتي بچه ها نوجوان هستند. سر بچه ها داد مي زند: آن شكلي بيرون نرو ، مردم چه فكري مي كنند. چون زن است احساساتي تر از همتاي مردش است. اما هيچ وقت او را مثل آبگرمكن در حال جوشيدن نمي بينيد."."\n"." او مصمم است كه شغلي براي خود دست و پا كند و در آمدي هرچند اندك داشته باشد. اغلب اين دختران در زندگي بايد هدفي داشته باشند و در پي رسيدن به آن تلاش كنند ."."\n"." دختر متولد برج دي هيچ چيز را راحت به دست نمي آورد. او براي رسيدن به خواسته هايش بايد صرفه جويي كند و مثل يك درويش زندگي كند . اگر آدم مثبتي باشد، گرفتاري و رنجها را به حساب تجربه مي گذارد و سعي دارد تا از اشتباهات و بدبختي ها درس عبرت بگيرد. اما امان از وقتي كه حس شوخ طبعي اش گل كند."."\n"." او دختري با سليقه و شيك است. ( به سر و وضعش نگاه نكنيد) قيافه مهربان او ديدني است . برخي از اين دختران سرشار از زيبايي و جذبه هسستند و با هوش و تدبير خود ديگران را ميخكوب مي كنند ."."\n"." بهتر از اين چه مي خواهيد ؟";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-bahman")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد بهمن:"."\n"."نماد : دلو"."\n"." باور كنيد نمي توانم او را به خوبي توصيف كنم و بگويم شبيه به چيست. چون او پيرو هيچ چيز نيست. گاهي موهايش را مثل پسرها كوتاه مي كند و دامني مي پوشد كه قوزك پايش را هم مي پوشاند. زنان متولد برج بهمن اولين كساني بودند كه سايه چشم صورتي، قرمز روشن و آلبالويي و رژلب ارغواني مصرف كردند. چون گرايش زيادي به جفت و جور كردن رنگها دارند ."."\n"." همه ما مي خواهيم كه ديگران ما را دوست بدارند اما هر يك به روشهاي مختلف. تا جايي كه مي توانيد به او آزادي و استقلال دهيد تا شما را دوست بدارد. اگر همسر شما متولد اين برج است انتظار نداشته باشيد كه آرام بنشيند، دمپايي شما را جفت كند و بچه را در تخت بخوابند و هر شب شير كاكائو درست كند. در غير اينصورت يك شب وقتي به خانه بر مي گرديد مي بينيد كه طغيان كرده، شيركاكائو را روي تخت ريخته ، دمپايي شما را پوشيده و از خانه بيرون مي رود. قطعاً پس از ازدواج براي خود حساب بانكي جداگانه اي دارد. او دوست دارد كه مردش بيرون از خانه كار كند شايد مجبورشويد در منزل بمانيد از نوزادتان نگهداري كنيد ! اومي خواهد درخشش خود را حفظ كند و دوست ندارد كه ببيند با يك كهنه كهنه بچه از جلا افتاده است ؟ از آنجا كه نظرش در باره همه چيز تغيير ميكند، گاهي دو رو به نظر ميرسد. گاهي نيز عمداً سعي مي كند، شما را عصباني كند. بهترين برخورد اين است كه يك كلمه هم حرف نزنيد و پيشنهاد نكنيد(صم ويكم باشيد) چون مطمئناً بر خلاف نظر شما عمل خواهد كرد."."\n"." او بچه ها را مثل هم تربيت مي كند. او مي تواند خيلي افراطي باشد و بدون هيچ نگراني در اتوبوس به  بچه شير بدهد."."\n"." او مي خواهد بچه ها را متناسب با قرن جديد تربيت كند و آنها را به مدارس خارجي بفرستد."."\n"." دختر متولد اين برج تندر و صاعقه طالع بيني است.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
			else if ($data->text == "hz-esfand")
			{
				$database->update("users", ['last_query' =>null], [ 'id' => $data->user_id ]);
				$text= "زن متولد اسفند:"."\n"."نماد : حوت"."\n"." واي خداي من عجب زن رويايي! اگر سعي كنيد او را به خيال پردازي متهم كنيد،( با حالتي آرامش بخش!) به طور انتقاد آميزي شما را نگاه مي كند  و مي گويد كاملاً اشتباه مي كنيد. او واقع گرا است. گاهي هم همه چيز را آن قدر واقعي مي پندارد كه شايد در حاليكه فيلم غم انگيزي مي بيند ، هق هق زيرگريه بزند، منظورم را كه مي فهميد!"."\n"." بطور كلي اين نشانه به قديسين مربوط مي شود. اما فراموش نكنيد زنان متول اين برج دو دسته هستند، دسته اول زني لوند با چشم و گوش بازو شيك است، دسته دوم آفتاب پرستي رويايي است . برخي از اين زنان از چنان قدرت تظاهري برخوردارند كه تارهاي خيال پردازي كه به دور خود تنيده اند ، مي توانند واقعاً باور كنند."."\n"." او زني است كه مي تواند به محض اينكه شما ( به عنوان همسر ) صبح خانه را ترك كرديد وبه محل رفتيد ، مثل زمان هجده سالگي اش لباس بپوشيد و از خانه بيرون برود. او با كفشهاي پاشه بلندي كه پوشيده به زحمت قدم مي زند و اوقات خوبي را مي گذارند و قبل از شما به خانه بر مي گردد و مي گويد كه تمام روز را در خانه بوده و گردگيري مي كردها ( لبته همه آنها اينطور نيستند). بعضي از آنها آنقدرعشاق و شيفته شريك هستند كه به هيچ وجه نمي توانند بارگناه خيانت كاري را تحمل كنند ."."\n"." زن متولد اين برج واقعاً رويايي است. وي شيفته خانواده و دوستان است. او از جريحه دار كردن احساسات ديگران متنفر است و مثل متولد برج مهر به جاي رويارويي با مسايل ، خود را درگير آنها نكرده و اغلب با آنها مواجه نمي شود. از آنجا كه توانايي همدلي با ديگران را دارد، مادر خوبي نيز هست و از وظايف خود شانه خالي نمي كند. او بچه ها را غرق محبت مي كند. او سعي دارد از بچه ها خيلي مراقبت كند تاجايي كه آنها در مي يابند گاهي حس استقلال خود را از دست مي دهند و تازه وقتي با دنياي واقعي روبروي شوند مي بينند كه با دنيايي كه ما در ترسيم كرده، خيلي تفوت دارد. براي او خيلي سخت است كه بچه ها را تنبيه كند و وقتي با بچه ها درشتي مي كند و سر آنها داد مي كشد  خودش بيش از آنها ناراحت مي شود. زني رامي ناسم كه متولد همين برج است. او يكبار آنقدر از دست بچه هايش عصباني شده بود كه به آنها گفته بود كه ميرود و آنها را تنها مي گذارد. بعد در را محكم به هم كوبيده و در كابينت قايم شده بود! ولي پنج دقيقه بعد بيرون آمده بود.ا و را براي روي آوردن به مشروبات الكلي مستعد مي دانند."."\n"." يكي ديگر از دوره بحراني كه مادر متولد برج اسفند مي گذراندوقتي است كه بچه هاي بي تجربه او خانه را ترك مي كنند و او هم به سراغ خيالبافي مي رود و تصور مي كند كه آنها نوزاد هستند. اين خطر هميشه وجود دارد كه در سكوت در آبهاي خيال پردازي شناور شود. چوب و قلاب ماهي گيري بخريد و او را بيرون بكشيد.";
				
				$telegram->editMessageText([
				'chat_id' => $data->chat_id,
				'message_id' => $data->message_id,
				'parse_mode' => 'HTML',
				'text' => $text
				]);
			}
		}
		else
		{
			$database->update("users", [ 'last_query' => 'hendi' ], [ 'id' => $data->user_id ]);
			$telegram->sendMessage([
			'chat_id' => $data->chat_id,
			'text' => "ابتدا جنسیت خود را انتخاب نمایید:",
			'reply_markup' => $keyboard->key_fal_hendi_jensiat()
			]);
		}
	}
?>



