<?php
/*
? In The Name Of God 
? website ? http://FilePick.ir/
? Channel ? @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	if ($data->callback_query)
	{
		if ($data->text == "orange")
		{
			$text= "🍊 پرتقال:"."\n"."اگرپرتقال میوه محبوب شماست شما آدمی پر قدرت و بسیار صبورید و دوست دارید كارها را به آرامی و با متانت اما درعین حال با درایت كامل و جسارت به انجام برسانید. سختكوش و پر تلاش و كمی خجالتی هستید اما در دوستی می توان بشما اعتماد كرد. شما دوستان خود را با دقت انتخاب كرده وبا تمام وجود به انها عشق می ورزید واز درگیری وتنش به هرقیمت پرهیز میكنید.";
		}
		else if ($data->text == "apple")
		{
			$text= "🍏 سیب:"."\n"."چنانچه سیب میوه محبوب شماست فردی اسرافكاروبسیار رك گوهستید. اگر چه ممكن است شخصاٌ بهترین سازمان دهنده ومدیر نباشید اما می توانید رهبر یك تیم كوچك باشید كه با تلاش زیاد تیم را به موفقیتهای بزرگ میرسانید. دربیشتر موقعیتها میتوانید بسرعت و بدرستی تصمیم بگیرید. شما از سفرهای كوتاه و غیرمنتظره لذت میبرید. زمانی كه با شریك زندگی خود بسر می برید جذاب و خونگرم بنظر می آیید وبشدت عاشق زندگی به مفهوم واقعی آن هستید";
		}
		else if ($data->text == "pineapple")
		{
			$text= "🍍 آناناس:"."\n"."بسیار سریع تصمیم میگیرید وسریعترازآن عمل می كنید. در تغییر شغل و خطر كردن درزمینه اجتماعی شجاع و بی باك هستید. شما دارای یك توانایی استثنایی در مدیریت می باشید ونمی گذارید كار روی دستتان بماند.";
		}
		else if ($data->text == "banana")
		{
			$text= "🍌 موز:"."\n"."عاشقان موز افردی دوست داشتنی آرام گرم و طبیعتا با احساس هستید. شما غالبا از نداشتن اعتماد بنفس وخجالتی بودن دررنج هستید. دیگران از طبع آرام و شیرینتان سوء استفاده كرده وسعی می كنند به این وسیله برای خود موقعیتهای جالبی را رقم بزنند. عاشق شریك زندگی خود درتمام زمینه ها هستید واین عشق بخاطر زیبایی جسمی و روحی اوست! بخاطر روشی كه دارید روابط شما با او همواره دریك هماهنگی كامل است.";
		}
		else if ($data->text == "coconuts")
		{
			$text= "🌰 نارگیل:"."\n"."شما دوستداران این میوه سنگین و كمیاب افرادی جدی با فكر وبا شعور هستید. از روابط اجتماعی لذت می برید و بویژه روی همراهان و دوستان خود حساسیت خاصی دارید. ممكن است كمی خودخواه بنظر آیید اما لزوما چنین صفتی در شما برجسته نمی شود. شما فردی سریع الانتقال آگاه و گوش بزنگ هستید كه در این زمینه شغلی همیشه در بالاترین رده قرار داشته و به بهترین نحو كارها را انجام می دهید. شما نیاز به شریكی عاقل داشته و عقل و احساس را باهم در این مسئله دخالت نمی دهید.";
		}
		else if ($data->text == "pear")
		{
			$text= "🍐 گلابی:"."\n"." چنانچه فكر خود را معطوف به انجام كاری میكنید میتوانید آن را با موفقیت به انجام برسانید. شما دوست دارید كه نتیجه تلاشهایتان را به سرعت ببینید. از انگیزه های مفید ذهنی لذت برده و دنباله رو آن هستید. كمی خجالتی به نظر میرسید و در بیان احساسات خود چندان راحت نیستید. زمانی كه بدنبال شریك زندگی هستید به هوش سرشار دید وسیع و دل دریایی اش اهمیت میدهد.";
		}
		else if ($data->text == "cherry")
		{
			$text= "🍒 گیلاس:"."\n"."چنانچه گیلاس میوه محبوب شماست زندگی همیشه به شیرینی كه در نظر دارید خود را بشما نشان نمی دهد. فراز و فرود در زندگیتان زیاد است بویژه در موقعیتهای حرفه ای و كاری . شما همیشه ودرهرپروژه ای كمی پول بدست می آورید و نه بمقدارزیاد. ذهنی فعال وخلاق داشته و غالبا بدنبال چیزهای نوهستید. شما شریكی صمیمی و وفادارهستید اما اثر گذاشتن بر احساسات شما كار ساده ای نیست. خانه تان برای شما بمنزله بهشت است و هیچ چیزی را بیشترازاین دوست ندارید كه درمنزل باشید ودوستان وآشنایان و افراد خانواده شما را دوره كنند.";
		}
		else if ($data->text == "grape")
		{
			$text= "🍇 انگور سیاه:"."\n"."بطوركلی آدمی مودب وخوشرو هستید اما گاهی اوقات سریع وبشدت عصبانی می شوید هرچند به همان سرعت نیزعصبانیت شما فروكش می كند. اززیباییها به هرشكلی كه باشد لذت می برید.بسیارمحبوب ومورد علاقه دیگران هستید واین محبوبیت بعلت طبیعت گرم شماست. شور و شوق و علاقه وافری به زندگی دارید وازهركاری كه می كنید لذت می برید اعم ازلباس پوشیدن خوردن وخوابیدن.شریك شما باید درتمام شوروعلاقه شما سهیم باشد تا بتواند ازتمام چیزی كه به اوهدیه می دهید لذت ببرد!";
		}
		else if ($data->text == "peach")
		{
			$text= "🍑 هلو:"."\n"."درست مثل هلو شما از عصاره زندگی لذت میبرید. فردی رك گوبوده و روشی دوستانه دارید در بخشش و فراموش كردن نظیر ندارید و برای دوستیها ارزش بسیار زیادی قائل هستید. حس استقلال طلبی در شما بسیار قوی است و این امر از شما فردی راستگو ساخته است.عاشقی ایده آل صبور صمیمی و یكرنگ هستید با این حال به هیچ وجه دوست ندارید احساسات خود را در ملاء عام بروز دهید.";
		}
		
		$telegram->editMessageText([
		'chat_id' => $data->chat_id,
		'message_id' => $data->message_id,
		'parse_mode' => 'HTML',
		'text' => $text,
		'reply_markup' => $keyboard->key_talebini_mive()
		]);
		
		$telegram->answerCallbackQuery([
		'callback_query_id' => $data->callback_query_id,
		'show_alert' => false,
		'text'=>"طالع بینی میوه مورد نظر ارسال شد"
		]);
	}
	else
	{
		$database->update("users", [ 'last_request' => null ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
		'chat_id' => $data->chat_id,
		'parse_mode' => 'HTML',
		'text' => "<a href='".$auth->path."/actions/talebini/sub-menu/images/miveha.jpg'>‌‌</a>"."آيا مي دانيد كه مي توانيد از روي ميوه هاي انتخاب شده شخصيت آدمها را بشناسيدو بر اساس ميوه هاي مورد نظر بگوييد كه شرايط روحي و رواني اشخاص مختلف چگونه است؟ پس ميوه دلخواه خود را انتخاب كنيد و به رازهاي شخصيتي خود و دوستانتان پي ببريد.",
		'reply_markup' => $keyboard->key_talebini_mive()
		]);
	}
?>

