<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	if ($data->callback_query)
	{
		if ($data->text == "santor")
		{
			$text= "سنتور:"."\n"."رفتار شما بسیار دلنشین است اما گاهی دیگران را از خود می رنجانید و این به دلیل شرایطی است که برای شما به وجود می آید. همیشه فکر می کنید که دیگران شما را درک نمی کنند اما این قضاوت در برخی موارد اشتباه است. یک نکته ی مهم دیگر این است که برای رسیدن به مقصد باید صبر پیشه کنید و جالب تر آنکه خود نسبت به این موضوع آگاه هستید.";
		}
		else if ($data->text == "guitar")
		{
			$text= "گیتار:"."\n"."به اصطلاح شما فردی سرزنده و فعال هستید. در ارتباط خود با دیگران به دنبال واژه های درشت نمی گردید. شاید گاهی برای صحبت کردن از احساسات خود دچار مشکل می شوید ولی سعی کنید تا از آنچه هستید راحتتر باشید. کلام شما ساده اما دلنشین است و یکی از ویژگیهای شما آن است که اگر کسی را دوست بدارید نمی توانید به راحتی او را فراموش کنید. روابط اجتماعی مناسبی دارید و به شب های پر ستاره علاقه مندید.";
		}
		else if ($data->text == "piano")
		{
			$text= "پیانو:"."\n"."شما شخصیت آرامی دارید. تفکر منحصر به فرد شما، شما را از دیگران متمایز می کند. آرزوهای شما یا خیلی دور هستند یا خیلی نزدیک و بین این دو ستاره ای از آرزو برای شما چنان نمی درخشد که نظر شما را جلب کند. تخیل زیبایتان توانایی آنرا دارد تا به حقیقتی دست یافتنی و ملموس تبدیل شود حتی اگر دیگران آن را تأیید نکنند.";
		}
		else if ($data->text == "setar")
		{
			$text= "سه تار:"."\n"."اندیشه های عارفانه ای دارید. به آینده بسیار می اندیشید و آنچه در اطراف شما می گذرد برای شخصیت شما اهمیت کمتری دارد. در اثبات حسن نیت خود سعی و تلاش می کنید و در بعضی مواقع دست از آن برمی دارید. انسان مستعدی هستید و این به آن معناست که با کمی تلاش می توانید به قله های دست نیافتنی، برسید. البته بسیار خیال پرداز نیستید و دنیای ذهنی شما یک دنیای دست یافتنی است.";
		}
		else if ($data->text == "org")
		{
			$text= "ارگ:"."\n"."شما یک فرد کاملا احساساتی هستید. با آنکه در بعضی مواقع آنرا بروز نمی دهید اما به این فکر می کنید که آیا کسی که دوستش دارید نیز به شما می اندیشد؟ بدانید که او نیز شما را تا حد امکان دوست دارد. حس و نوع عشق شما از عشق های صادقانه است که شاید برای کمتر کسی اتفاق بیفتد.";
		}
		else if ($data->text == "violon")
		{
			$text= "ویولون:"."\n"."شما فردی بسیار زیرک و باهوش هستید و متوجه نکاتی می شوید که دیگران از آنها غافلند. به زبان ساده یعنی مو را از ماست می کشید. باید در مسیر زندگی خود پا پیش بگذارید تا بتوانید موفق شوید و قبل از انجام هر کاری درباره ی آن بیندیشید تا موقعیت های خوب را شکار کنید. غرور شما قسمتی از شخصیت شماست پس نه به راحتی آنرا زیر پا بگذارید و نه آنرا سر سختانه برای خود حفظ کنید.خوشبختی شما در گرو استفاده ی به موقع از لحظه هاست، لحظه و زمان را از دست ندهید.";
		}
		else if ($data->text == "daf")
		{
			$text= "دف:"."\n"."از ارتباط با خداوند لذت می برید و این امر نشأت گرفته از اندیشه های عارفانه ی شماست . در ذهن و افکار خود به سیر و سفر می پردازید و این سفر نه به معنای سفر از شهری به شهر دیگر، بلکه از عالمی به عالم دیگر است. شما دوست دارید که در آن عالم لحظاتی را سپری کنید، در آنجا بغض خود را بشکنید و خالصانه با خدای خود حرف بزنید. شاید فکر می کنید خدا شما را فراموش کرده است اما خدا بندگانش را هرگز فراموش نمی کند.";
		}
		else if ($data->text == "accardeun")
		{
			$text= "آکاردئون:"."\n"."وجود شما سراسر از عشق است و شما عاشق دوست داشتن هستید.آنچه که شما گم کرده اید و به جستجوی آن می پردازید درون شما وجود دارد.به اطراف خود بیشتر توجه کنید، گم کرده ی شما بسیار نزدیک به شماست، سعی کنید مهار زندگی خود را در دست داشته باشید تا آن را بیشتر رام کنید.";
		}
		else if ($data->text == "sheypoor")
		{
			$text= "شیپور:"."\n"."شما یک انسان خوش نشین هستید. دیگران فکر می کنند به راحتی می توانند به درون شما پی ببرند اما به واقع خلاف این موضوع است. با آنکه به طور غیر مستقیم در حل مسائل خود از دیگران کمک می گیرید اما سعی کنید تا از اندیشه های دیگران نیز به طور مستقیم بیشتر استفاده کنید";
		}
		
		$telegram->editMessageText([
		'chat_id' => $data->chat_id,
		'message_id' => $data->message_id,
		'parse_mode' => 'HTML',
		'text' => $text,
		'reply_markup' => $keyboard->key_talebini_music()
		]);
		
		$telegram->answerCallbackQuery([
		'callback_query_id' => $data->callback_query_id,
		'show_alert' => false,
		'text'=>"طالع بینی ساز مورد نظر ارسال شد"
		]);
	}
	else
	{
		$database->update("users", [ 'last_request' => null ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
		'chat_id' => $data->chat_id,
		'parse_mode' => 'HTML',
		'text' => "<a href='".$auth->path."/actions/talebini/sub-menu/images/music.jpg'>‌‌</a>"."فال خود را با توجه به ساز مورد علاقه خود ببینید."."\n"."ابتدا از بین سازهای زیر ساز مورد علاقه خود را انتخاب کنید :",
		'reply_markup' => $keyboard->key_talebini_music()
		]);
	}
?>

