<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	if ($data->callback_query)
	{
		if ($data->text == "sang-farvardin")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/farvardin.jpg'>‌‌</a>"."متولدین فروردین :"."\n"."الماس، یکی از گرانبهاترین و زیباترین سنگهای موجود در طبیعت با متولدین فروردین ارتباط بیشتری برقرار می‌کند. این سنگ اعتماد به نفس را افزایش می‌دهد و احساس شکست ناپذیری را در انسان تقویت می‌کند.الماس یکی از قدیمی ترین سنگهای موجود در طبیعت است که خاصیت تصفیه کنندگی دارد و مخصوصا روی کارکرد کلیه ها و مثانه اثر مثبتی می‌گذارد. علاوه بر آن کارایی و قدرت سنگهای دیگر را هم افزایش می‌دهد. فراموش نکنید متولد هر ماهی هستید و از هر سنگی استفاده می‌کنید افزودن الماس به گردن بند خود را از یاد نبرید.";
		}
		else if ($data->text == "sang-ordibehesht")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/ordibehesht.jpg'>‌‌</a>"."متولدین اردیبهشت :"."\n"."سنگ متولدین ماه میانی بهار، زمرد است. زمرد از زمان خیلی دور به عنوان سنگ درمانی به کار می‌رفته است. یکی از مهم ترین ویژگی های آن این است که روح و جسم را با هم متعادل می‌کند. این سنگ روی تیروئید و تصلب شرائین اثر می‌گذارد و در مورد بیمارانی که پارکینسون دارند یا مبتلا به صرع هستند روند درمان را بهبود می بخشد. زمرد فشار خون و بیماری قلبی را نیز کنترل می‌کند. در زمان های گذشته برای درمان بچه های کوچک هنگامی که به تب مبتلا می شدند مورد استفاده قرار می‌گرفته است. این سنگ ادراکات شهودی را افزایش می‌دهد و در ایجاد نبوغ تاثیر دارد. یوگی ها و کسانی که مدیتیشن می‌کنند اعتقاد دارند وقتی زمرد همراه دارند زودتر به تمرکز می‌‌رسند.";
		}
		else if ($data->text == "sang-khordad")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/khordad.jpg'>‌‌</a>"."متولدین خرداد : "."\n"."سنگ اختصاصی متولدین خرداد ماه مروارید است. به مروارید، داروی جادویی نیز می‌گویند. این سنگ روی اعصاب و کلیه عضلات اثر مثبت می‌گذارد و بیماریهای ناشی از کمبود کلسیم را برطرف می‌کند. مروارید نیروی حیات را افزایش می‌دهد و ضد اضطراب عمل می‌کند. علاوه بر آن همراه داشتن مروارید باعث میشود قوه ابتکار شما بهتر عمل کند و خلاقیتتان افزایش یابد.";
		}
		else if ($data->text == "sang-tir")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/tir.jpg'>‌‌</a>"."متولدین تیر :"."\n"."سنگ متولدین نخستین ماه تابستان «گارنت» است که به رنگ تیره و شبیه یاقوت قرمز در طبیعت دیده می‌شود. گارنت سنگ حامی مسافرینی است که با کشتی سفر می‌کنند. این سنگ برای استحکام دیواره های سرخرگ، تقویت چشم و درمان سرطان در مراحل اولیه آن کارایی دارد. اثرات این سنگ میان زنان بیشتر نمایان می‌شود. گارنت بیماریهای زنانگی را بهبود می‌بخشد و بر درمان اختلالات قاعدگی اثر مثبت می‌گذارد.";
		}
		else if ($data->text == "sang-mordad")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/mordad.jpg'>‌‌</a>"."متولدین مرداد :"."\n"."پریدوت و اونیکس سنگهای متولدین مرداد ماه هستند. اونیکس سنگی شبیه عقیق است که به رنگ سیاه یافت می‌شود. این سنگ برای درمان اعتیاد مورد مصرف دارد. به نظر می‌رسد از آن جا که اونیکس اعتماد به نفس و دلگرمی را افزایش می‌ دهد از گرایش افراد به سوی اعتیاد می کاهد. اونیکس روی سیاهرگها و مفاصل بخصوص در افرادی که که دچار نقرس هستند اثر مثبتی می‌گذارد و از لحاظ روانی موجب ازدیاد هماهنگی روحی انسان می‌شود.";
		}
		else if ($data->text == "sang-shahrivar")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/shahrivar.jpg'>‌‌</a>"."متولدین شهریور :"."\n"."یاقوت کبود سنگ مخصوص متولدین شهریور ماه است. این سنگ دارای خاصیت شفابخشی است و روی سلول های پوست، مو و ناخن خیلی تاثیر می‌گذارد. یاقوت کبود از ریزش مو جلوگیری می کند و سیستم عصبی را بهبود می‌بخشد. این سنگ درد را کاهش می دهد و برای بیماریهای مزمنی مثل روماتیسم و نقرس اثر مثبت دارد. علاوه بر آن برای درمان سرگیجه و جلوگیری از خونریزی زخم ها به کار می رود.";
		}
		else if ($data->text == "sang-mehr")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/mehr.jpg'>‌‌</a>"."متولدین مهر :"."\n"."متولدین مهر ماه می‌توانند از سنگهای مونستون و اوپال استفاده کنند. مونستون چندین رنگ دارد . سفید مایل به آبی، مایل به سبز و مایل به صورتی آن در طبیعت یافت می‌شود. سنگی است که روی اختلالات هورمونی خیلی تاثیر مثبتی دارد بخصوص شیر مادران را افزایش می دهد. این سنگ روی تیروئید هم اثر مثبت دارد و باعث می شود موانع احساسی شخص از بین برود."."\n"."اوپال از خانواده عقیق است و سنگی است که در کشور استرالیا به دست می‌آید. این سنگ روی التهابات روده و معده موثر است و بر جریان خون نیز اثر می‌گذارد. از این سنگ به طلسم خوشبختی نیز یاد شده است. در گذشته مرسوم بوده که از اشخاص مبتلا به افسردگی ، در خواست می‌کردند به اوپال سیاه نگاه کنند چون اعتقاد داشتند این کار افسردگی آنها را از بین می‌برده است.";
		}
		else if ($data->text == "sang-aban")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/aban.jpg'>‌‌</a>"."متولدین آبان :"."\n"."سیترین و یاقوت قرمز سنگ های متولدین این ماه هستند. یاقوت قرمز برای بیماریهای ویروسی و اپیدمی، همچنین درمان تب مفید است. این سنگ بیحسی و رخوت را از بین می‌برد و از زایمان زودرس جلوگیری می‌کند. یاقوت قرمز ایمنی بدن را افزایش می‌دهد و از لحاظ روانی هم باعث رهایی از وابستگی های روانی می‌شود. از زمان قدیم متداول بوده که به زوجهای جوان توصیه می‌شده این سنگ را برای وفای بیشتر نسبت به شریک زندگی به گردن بیاویزند.";
		}
		else if ($data->text == "sang-azar")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/azar.jpg'>‌‌</a>"."متولدین آذر :"."\n"."رسیدیم به متولدین آذرماه و سنگ فیروزه. از سنگ فیروزه به عنوان سنگ حامی یاد شده است. معروف است که در اروپا خلبانان و مهمانداران هواپیما برای ایمنی در سفر از فیروزه استفاده می‌کنند. چون این سنگ از سقوط جلوگیری می‌کند. فیروزه بر روی عملکرد نادرست کبد اثر می؟‌گذارد و قدرت و سوی چشم را افزایش می‌دهد. فیروزه ضد افسردگی است، نشاط آور می‌آورد و التهبات پوستی را فرو می‌نشاند.";
		}
		else if ($data->text == "sang-dey")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang.jpg'>‌‌</a>"."متولدین دی :"."\n"."نکته عجیبی است! متولدین دی ماه سنگ مخصوص به خود ندارند اما در عوض همه سنگها با تمام خواصشان برای آنها مفید هستند. پس آزاد هستید با توجه به علاقه و تمایلتان هر سنگی را که می‌خواهید انتخاب کنید.";
		}
		else if ($data->text == "sang-bahman")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/bahman.jpg'>‌‌</a>"."متولدین بهمن :"."\n"."آماتیست، سنگ کریستالی بنفشی که به اضطراب پایان می‌دهد سنگ متولدین بهمن ماه است. این سنگ ضد اضطراب و کابوس است و برای کسانی که بدخواب هستند یا مدام کابوس می‌بینند توصیه شده است. تجربه نشان داده است که افراد مضطرب وقتی آماتیست همراه خود دارند به آرامش می‌رسند.";
		}
		else if ($data->text == "sang-esfand")
		{
			$text= "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang/esfand.jpg'>‌‌</a>"."متولدین اسفند :"."\n"."متولدین آخرین ماه سال با مرجان پیوند برقرار می‌کنند. مرجان از گیاه دریایی به دست می‌آید و از رنگ قرمز پررنگ تا گل بهی و صورتی یافت می‌شود. چون منشاء آن کلسیم است روی بیماری استخوانها بخصوص راشیتیسم تاثیر مثبت می‌گذارد. مرجان برای استحکام دندانها مفید است و انعطاف پذیری را هم تقویت می‌کند. متولدین اسفندی که به راحتی نمی‌توانند خود را با محیط وفق دهند با همراه داشتن مرجان می‌توانند بر این ضعف فائق آیند.";
		}
		
		$telegram->editMessageText([
		'chat_id' => $data->chat_id,
		'message_id' => $data->message_id,
		'parse_mode' => 'HTML',
		'text' => $text,
		'reply_markup' => $keyboard->key_talebini_sang() 
		]);
		
		$telegram->answerCallbackQuery([
		'callback_query_id' => $data->callback_query_id,
		'show_alert' => false,
		'text'=>"طالع بینی سنگ ماه مورد نظر ارسال شد"
		]);
	}
	else
	{
		$database->update("users", [ 'last_request' => null ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
		'chat_id' => $data->chat_id,
		'parse_mode' => 'HTML',
		'text' => "<a href='".$auth->path."/actions/talebini/sub-menu/images/sang.jpg'>‌‌</a>"."شاید قبلأ شنیده باشید که متولدین ماههای مختلف ، سنگهای مخصوص به خودشان را دارند که البته گفته میشود که این سنگها برای آنها علاوه بر خوش یمن بودن باعث سلامتی ایشان نیز میشود."."\n"."برای مشاهده سنگ ماه تولد خود از لیست زیر ماه تولد خود را انتخاب نمایید:",
		'reply_markup' => $keyboard->key_talebini_sang()
		]);
	}
?>

