<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	if ($data->callback_query)
	{
		if ($data->text == "test2-1")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۱ :"."\n"."افرادی که بر روی پشت می خوابند دارای این ویژگی ها می باشند : آزادی خواه ، راحت طلب ، ولخرجی ، دارای جسارت ، ساده لوح ، خوش شانس ، خوش گذران ، دارای ذهن آرام ، بیماری احتمالی: رنج بردن از نفخ";
		}
		else if ($data->text == "test2-2")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۲ :"."\n"."میانه رو ، نتیجه گیری کم در مقابل تلاش زیاد ، دارای آینده خوب ، پشتکار ، بیماری احتمالی: رنج بردن از فشار خون بالا ، علاقه به مسایل علمی و سیاسی";
		}
		else if ($data->text == "test2-3")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۳ :"."\n"."کسانی که به سمت چپ می خوابند اصولا آدم هایی لج باز و هستند ، دایما در حال ساز مخالف زدن می باشند ، و بهتر است که شیوه که خود را تغییر دهند، بیماری احتمالی: رنج بردن از فشار خون پایین";
		}
		else if ($data->text == "test2-4")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۴ :"."\n"." دوستدار رهایی و آزادی ، رفتن زیاد به دستشویی در شب هنگام ، راحت طلب ، زیاد خواب خوش می بیند ، تمیل زیاد به پیدا کردن دوست ، میانه رو ، دوستدار محیط زیست ،بیماری احتمالی: رنج بردن از تنگی نفس";
		}
		else if ($data->text == "test2-5")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۵ :"."\n"."محافظه کار ، به راحتی خوشحال و ناراحت می شود ، تمایل زیاد به ازدواج ، دوستدار بچه و بچه دوست ، زودرنج ، زرنگ و باهوش، دارای حافظه قوی ، بیماری و ناخوشی احتمالی:چاقی و چربی در پهلوها";
		}
		else if ($data->text == "test2-6")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۶ :"."\n"."بلند پرواز،  دارای آرزوهای بزرگ ، فرار از مشکلات زندگی و در عوض فشار آوردن به چیزهای دیگر ، از زیر مسئولیت شانه خالی می کند، علاقه به دوستی های متعدد ، عدم تمایل به ازدواج ، بیماری احتمالی: رنج بردن از سردرد";
		}
		else if ($data->text == "test2-7")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۷ :"."\n"."شدیدا وابسته به خانه و اهالی خانواده ، عدم تمایل به ازدواج ، علاقه به سفرهای درون شهری ، دارای شکم بزرگ ، حافظه ضعیف ، زود باور، بیماری احتمالی : ضعف حافظه";
		}
		else if ($data->text == "test2-8")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۸ :"."\n"." عجول ، دارای تیکه کلام دیدی گفتم ، تند تند راه می رود ، در حال راه رفتن غذا می خورد ، خود نما ، خودخواه ، بد قول ، تمایل به ازدواج های مکرر و پنهانی ، بیماری احتمالی: رنج بردن از تکرر ادرار";
		}
		else if ($data->text == "test2-9")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۹ :"."\n"."تمایل به خواب فراوان ، اهل مهمانی ، وراج و لاف زن ، دوست دارد خودنمایی کند ، زود از کوره در می رود ، پیش بینی هایش همیشه غلط از آب در میایند ، بی حوصله ، بیماری احتمالی: رنج بردن از چربی خون و چاقی";
		}
		else if ($data->text == "test2-10")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۱۰ :"."\n"."بیکار، قدم زدن را دوست دارد ، هرجایی که باشد فرقی نمی کند کجا خوابش بیاید همانجا می خوابد ، عدم توازن بین ساعت کاری و استراحت ، بیماری احتمالی: رنج بردن از مشکلات گوارشی";
		}
		else if ($data->text == "test2-11")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۱۱ :"."\n"."پنهانکار ، زیاد راز دارد ، خسته از زندگی گذشته ، دوست ندارد شیوه ی جدیدی به زندگی اش بدهد ، همیشه ناراضی ، تمایل به ازدواج های مکرر ، بیماری احتمالی : رنج بردن از مشکل روده بزرگ";
		}
		else if ($data->text == "test2-12")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."• شخصیت شناسی بر اساس خوابیدن مدل شماره ۱۲ :"."\n"."دوست دارد دیگران برایش تصمیم بگیرند ، چاپلوس ، تحقیر کننده افراده ضعیف ، دعوا و اغتشاشگر ، اهل خیانت ، وفادار، بیماری احتمالی : مشکل مغزی";
		}
		
		$telegram->editMessageText([
		'chat_id' => $data->chat_id,
		'message_id' => $data->message_id,
		'parse_mode' => 'HTML',
		'text' => $text,
		'reply_markup' => $keyboard->key_test_test2() 
		]);
		
		$telegram->answerCallbackQuery([
		'callback_query_id' => $data->callback_query_id,
		'show_alert' => false,
		'text'=>"شخصیت شما ارسال شد"
		]);
	}
	else
	{
		$database->update("users", [ 'last_request' => null ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
		'chat_id' => $data->chat_id,
		'parse_mode' => 'HTML',
		'text' => "<a href='".$auth->path."/actions/test/sub-menu/images/test2.jpg'>‌‌</a>"."تست شخصیت شناسی از روی مدل خواب افراد"."\n"."تست شخصیت شناسی بر اساس مدل خواب افراد کاملا روانشناختی است. هر شخص نحوه ی خوابیدن خاصی را علاقه دارد و آن بر طبق روحیات و احساسات شخص می باشد که در موقع خواب نمود پیدا می کند. ۱۲ مدل خواب که در میان افراد مختلف بیشتر رواج دارد در این تست شخصیت شناسی ارائه شده است."."\n"."در این تست شخصیت شناسی که بر اساس روش خوابیدن است حالت عمده خوابیدن یک فرد در طول خواب است. شما می توانید با دقت در تصویر مدل خوابیدن خود را پیدا کنید و خصوصیات اخلاقی مربوط به همان شماره را مطالعه کنید و به هیجان بیایید. این تست روانشناسی نکات فراوانی از شخصیت افراد مختلف را بیان می کند که ممکن است شما را شگفت زده نماید."."\n"."براساس تصویر زیر شماره مورد نظر راا نتخاب نمایید:",
		'reply_markup' => $keyboard->key_test_test2()
		]);
	}
?>

