<?php
/*
● In The Name Of God 
● website 》 http://FilePick.ir/
● Channel 》 @FilePick
*/
	require_once dirname(__FILE__) . '/../../../autoload.php';
	if ($data->callback_query)
	{
		if ($data->text == "test6-1")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test6.jpg'>‌‌</a>"."حالت A:"."\n"."این گونه اشخاص تصور می کنند نادیده گرفتن مشکلات باعث می شود خود مشکل به کلی رفع شود. متاسفانه این گونه افراد ترجیح می دهند وظایفشان را به دیگران محول کنند چون دوست ندارند خودشان را به زحمت بیندازند و یا وقت با ارزش خود را به راحتی هدر دهند. ارتباط با این شخصیت ها بسیار آسان است. این افراد جالب، خلاق، جذاب هستند و کمی رفتار کودکانه دارند. آن ها معمولا قبل از حرف زدن فکر نمی کنند و وقتی می فهمند چه چیزی گفته اند که خیلی دیر شده.";
		}
		else if ($data->text == "test6-2")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test6.jpg'>‌‌</a>"."حالت B:"."\n"."این افراد رویاپردازانی هستند که قوه تخیل بالایی دارند. آن ها پر از ایده های جدیدی هستند که در محیط کار تحسین برانگیز است. این شخصیت ها روزمرگی را دوست ندارند و عاشق سفر و پیدا کردن دوست های جدید هستند. آن ها هیچ مشکلی با از نو شروع کردن ندارند و هرگز وقتشان را با رابطه ای که خوشحالشان نمی کند یا کاری که انرژی مثبت را از آن ها بگیرد هدر نمی دهند.";
		}
		else if ($data->text == "test6-3")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test6.jpg'>‌‌</a>"."حالت C:"."\n"."در رابطه با این اشخاص آرامش حرف اول را می زند. آن ها هنگامی که تصمیم می گیرند خرید کنند روزها درباره آن فکر می کنند و در آخر از جای مناسبی خرید می کنند چون می خواهند مناسب ترین و بی نقص ترین خرید را داشته باشند. این افراد در انتخاب لباس، کفش، عطر و مبل بسیار سخت گیر و نکته سنج هستند. این شخصیت ها بی نظم هستند اما می دانند که در شرایط بی نظم و آشفته چگونه وظایف شان را انجام دهند. آن ها زیاد قدرت تمرکز ندارند و ذهن آشفته ای دارند و این برای اطرافیان شان زیاد لذت بخش نیست چون دوست ندارند مخاطب شان به حرف های آن ها توجهی نکند.";
		}
		else if ($data->text == "test6-4")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test6.jpg'>‌‌</a>"."حالت D:"."\n"."افرادی که با این حالت می نشینند از تاخیر بیزارند و دوست ندارند دیگران هم چنین ویژگی داشته باشند. این ویژگی شخصیتی را افرادی دارند که آرامش برایشان در درجه اول اهمیت قرار دارد. آن ها از درگیر شدن با دیگران بیزارند و هیچوقت دوست ندارند عواطف خود را در ظاهر بروز دهند. به عنوان مثال بوسیدن برای آن ها نشانه صمیمیت بیش از حد است و انجام این کار در جمع برایشان ناخوشایند است. افرادی که به این حالت می نشینند در ابراز احساس مشکلی ندارند و در عین حال می توانند کمی هم خشن باشند. آن ها در مواجه شدن با مردم مشکلی ندارند. برای آن ها اجتماع شبیه به میدان جنگ است و در مقابل دشمنان محتاطانه عمل می کنند. خانه برای آن ها مکان مقدسی است که می توانند درآن کاملا آزاد و رها باشند. این افراد انتقاد پذیر نیستند چون انتقاد را نوعی حمله به شخصیت خود می دانند و در مقابل آن از خود دفاع می کنند.";
		}
		else if ($data->text == "test6-5")
		{
			$text= "<a href='".$auth->path."/actions/test/sub-menu/images/test6.jpg'>‌‌</a>"."حالت E:"."\n"."این گونه افراد هیچ وقت عجله نمی کنند و معتقدند که هر چیزی به وقتش رخ می دهد. آن ها لجباز و سمج هستند و تا زمانی که به هدفشان نرسند کم نمی آورند. برای این اشخاص ظاهر بسیار مهم است و تمام سعی خود را برای این که ظاهر خوبی داشته باشند می کنند. این ویژگی ممکن است به دلیل کمبود اعتماد به نفس باشد. کسانی که به این حالت می نشینند معمولا هر انتقادی را نیز به سختی می پذریند.";
		}
		
		$telegram->editMessageText([
		'chat_id' => $data->chat_id,
		'message_id' => $data->message_id,
		'parse_mode' => 'HTML',
		'text' => $text,
		'reply_markup' => $keyboard->key_test_test6() 
		]);
		
		$telegram->answerCallbackQuery([
		'callback_query_id' => $data->callback_query_id,
		'show_alert' => false,
		'text'=>"شخصیت شما ارسال شد"
		]);
	}
	else
	{
		$database->update("users", [ 'last_request' => null ], [ 'id' => $data->user_id ]);
		$telegram->sendMessage([
		'chat_id' => $data->chat_id,
		'parse_mode' => 'HTML',
		'text' => "<a href='".$auth->path."/actions/test/sub-menu/images/test6.jpg'>‌‌</a>"."باورتون بشه یا نه زبان بدن خیلی چیزها درباره شخصیت ها میگه. آیا تا به حال می دونستید که حالت پاها هنگام نشستن چیزهایی زیادی درباره نیات و اسرار درونی شما بیان میکنه؟ دفعه بعد که توی جمعی بودید به حالت نشستن شون دقت کنید تا یه چیزایی درباره شخصیت شون دستگیرتون بشه.",
		'reply_markup' => $keyboard->key_test_test6()
		]);
	}
?>

